                                                                                                                      /*
 Найдовші операції, з якими стикається фронтенд-розробник — це запити до бекенду (HTTP-запити до сервера)

 Вони асинхронні, бо потребують часу на:
                                        передачу даних через мережу   →   обробку на сервері   →   повернення відповіді


❗Тому їх не можна обробляти одразу — потрібно чекати, і виконувати обробку через callback, promise або async/await, ❗
   коли дані прийдуть. Тоді асинхронні операції (бекенд-запити, таймери тощо) не блокують інтерфейс.

 Це дозволяє сайту не зависати під час їх виконання та реагувати на дії користувача


 Бекенд — це серверна частина програми (наприклад, сайту чи застосунку), яка:

   ◦ отримує запити з браузера
   ◦ відправляє назад відповіді з даними (наприклад, користувача, пости, коментарі)

 Запит до бекенду — це завжди асинхронна дія: відповідь приходить не одразу, а через певний час (залежно від швидкості
 інтернету, сервера тощо)


‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 JavaScript — ЦЕ ОДНОПОТОЧНА МОВА. Тобто виконує код в одному потоці (one thread) — одна операція за раз, по черзі

 ЦЕ ОЗНАЧАЄ:

   ◦ Поки одна інструкція виконується, усі інші чекають

   ◦ Немає справжнього параленьного виконання задач в основному потоці (як у багатопоточних мовах - Java або C++)

   ◦ Увесь код виконується послідовно — зверху вниз

           ↓  ↓  ↓

  Усі асинхронні операції делегуються браузеру або Node.js

  Тобто асинхронність досягається завдяки делегуванню довгих задач (таймери, HTTP) в інші частини середовища (Web APIs),
  а результат повертається пізніше через Event Loop

  Асинхронні операції — це дії, які запускаються зараз, але їхній результат стає доступним пізніше, не блокуючи
  виконання іншого коду

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 Асинхронність у JS досягається завдяки середовищу виконання (браузеру чи Node.js), а не самим мовним механізмом:

  ◦ Сам JavaScript — однопоточний і синхронний за своєю природою

  ◦ Асинхронність реалізується через сервіси середовища (Web APIs у браузері, або відповідні API в Node.js)

  ◦ Наприклад:
               • Таймери (setTimeout, setInterval) — це Web API браузера

               • HTTP-запити (fetch, XMLHttpRequest) — теж Web API


 ЯК ЦЕ ПРАЦЮЄ:

       1. JavaScript виконує код

       2. Коли зустрічає асинхронну операцію, вона передається браузеру (в Web API)

       3. Web API виконує цю операцію поза основним потоком

       4. Коли операція завершується, результат ставиться в чергу коллбеків (Callback Queue)

       5. Event Loop виконує callback з черги, коли основний потік звільняється


 ВИСНОВОК:
           Асинхронність у JS — це здатність середовища виконання (браузер або Node.js) виконувати довгі операції поза
           основним потоком та повертати результат, не блокуючи виконання коду

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

                                                                                   Callback Queue
                                                                       ┌────────────────────────────────────┐
                                                                       │           Microtask queue          │
                                                                       │                                    │
                         ┌──────────────────────────────────────────   │  ◦ Promise.then()                  │
           Call Stack    ▼                                             │  ◦ Promise.catch()                 │
   ┌─────────────────────────┐                                         │  ◦ Promise.finally()               │
   │                         │                                         │ ─────────────────────────────────  │
   │                         │                                         │           Macrotask queue          │
   │                         │                                         │                                    │
   │                         │                                         │  ◦ setTimeout                      │
   │                         │                                         │  ◦ setInterval                     │
   │                         │              Event Loop                 │  ◦ Event Listeners (click, input)  │
   │                         │                                         │  ◦ Fetch API (HTTP requests)       │
   │                         │                                         └────────────────────────────────────┘
   │                         │                                                                ▲
   │   console.log()         │                                                                │
   └─────────────────────────┘                                                                │
                                                                   Web APIs                   │
                        │                            ┌────────────────────────────────────┐   │
                        └──────────────────────►     │  ◦ setTimeout                      │  ─┘
                                                     │  ◦ setInterval                     │
                                                     │  ◦ Event Listeners (click, input)  │
                                                     │  ◦ Fetch API (HTTP requests)       │
                                                     └────────────────────────────────────┘


‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

                                                   Event Loop
                                               ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
                            механізм, який дозволяє JS виконувати асинхронні операції

 Він не є частиною мови JavaScript — його реалізує середовище, в якому працює код, наприклад браузер

 Event Loop — це механізм, який з'єднує синхронний Call Stack з асинхронними операціями у Web APIs та Callback Queue,
 забезпечуючи безперервне виконання коду в JavaScript навіть при затримках, таймерах і подіях


  Як працює Event Loop:
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 1. Стежить за Call Stack (стеком викликів)

      ◦ Якщо Call Stack не порожній (тобто зараз виконується якась функція), Event Loop нічого не робить

      ◦ Якщо Call Stack порожній — переходить до Callback Queue

 2. Перевіряє Callback Queue (чергу зворотних викликів) на наявність функцій

      ◦ Callback Queue — це список асинхронних функцій, які вже готові до виконання
        (тобто Web API їх обробив: таймер минув, подія сталась тощо)

 3. Переміщує функцію з Callback Queue в Call Stack:

      ◦ Якщо Callback Queue не порожня — переносить першу функцію з Callback Queue до Call Stack,
        де вона одразу виконується

 4. Повторює цикл без зупинки

      ◦ Після виконання та завершення функції стек звільняється, Event Loop починає нову ітерацію

      ◦ Цикл Event Loop ніколи не зупиняється, поки працює програма

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
❗ Жоден callback з Callback Queue не потрапить у Call Stack, поки не завершиться виконання всього синхронного коду

   Тобто callback-и з Callback Queue можуть потрапити в Call Stack лише тоді, коли основний (синхронний) код завершить
   виконання

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
❗ Час у setTimeout — це мінімальний інтервал, після якого callback дозволено поставити в Callback Queue, але він
    виконається лише тоді, коли основний потік (Call Stack) буде вільний

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

                                      Call Stack (Стек викликів)
                                    ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
                       це структура даних, де відбувається виконання синхронного JS-коду


 Він працює за принципом LIFO (Last In — First Out) останнім прийшов — першим вийшов:

    1. Коли викликається функція — вона додається у верх стеку

    2. Якщо ця функція викликає іншу — нова також додається поверх попередньої

    3. Виконується лише та функція, яка зараз на вершині стеку

    4. Попередня функція заморожується — вона чекає, поки завершиться нова

    5. Коли верхня функція завершує виконання — вона видаляється зі стеку

    6. На вершину стеку повертається попередня функція — і продовжує виконання з того місця, де зупинилась

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 Це працює не лише з викликом функції всередині іншої функції. Кожну функцію Call Stack виконує поетапно, обробляючи по
 одній операції за раз:

    1. Коли викликається функція, вона додається у верх Call Stack

    2. Якщо всередині цієї функції є інші дії (інші функції, математичні обчислення, виклики методів тощо), то:

          ◦ кожна дія потрапляє у стек окремим записом
          ◦ нові дії кладуться поверх попередніх
          ◦ виконується лише верхній запис, а решта чекають своєї черги

    3. Як тільки поточна дія завершилась — вона видаляється зі стеку

    4. Наступна дія, що чекала знизу, тепер стає активною і виконується

    5. Коли всі дії в тілі функції завершені, сама функція повертається на вершину стеку і після виконання видаляється


 ВИСНОВОК:
         ❗Call Stack одночасно виконує лише одну операцію, суворо дотримуючись принципу LIFO ❗



                                ВЗАЄМОДІЯ Call Stack З АСИНХРОННИМИ ОПЕРАЦІЯМИ:
                               ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 1. Виклик setTimeout() потрапляє у Call Stack

    setTimeout() спочатку потрапляє в Call Stack, бо сама функція setTimeout — це звичайна синхронна функція, яка
    виконується одразу після потрапляння у Call Stack

 2. Ініціалізація асинхронної операції в Call Stack
    JS-движок ініціює передачу асинхронної операції браузеру: запускає таймер та реєструє callback, який потрібно буде
    виконати коли таймер сплине

 3. Браузер, після отримання інструкції щодо реалізації асинхронної операції від JS-движка, починає виконувати її у
    спеціальному оточенні — Web APIs

    Web APIs — це окремий механізм браузера, який відповідає за роботу з асинхронними операціями та працює паралельно
    з основним JS-потоком

 4. Асинхронна операція виконується поза Call Stack
    Браузер відраховує час таймера або виконує HTTP-запит, не блокуючи головний потік

 5. Після завершення асинхронної операції callback потрапляє у Callback Queue

    Коли таймер сплив або прийшла відповідь з серверу, функція, яку ми передали у setTimeout або у проміс, потрапляє у
    чергу очікування — Callback Queue

 6. Event Loop слідкує, чи вільний Call Stack
    Коли Call Stack порожній, Event Loop бере першу функцію з Callback Queue і переміщує її у Call Stack для виконання

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 Функція setTimeout — це звичайна синхронна функція, яка виконується одразу, коли потрапляє у Call Stack

 ЦЕ ОЗНАЧАЄ ЩО:
              заведення таймера (тобто виклик setTimeout) відбувається у Call Stack, і це — синхронна операція

    1. Коли JS-движок (наприклад V8) доходить до setTimeout(), цей виклик потрапляє у Call Stack

    2. JS миттєво передає завдання браузеру — "запусти таймер на 1000 мс і коли він сплине, виклич цей callback"

    3. Після цього setTimeout завершує виконання, видаляється зі стеку, і JS рухається далі

    4. Таймер вже працює у Web API браузера, очікуючи закінчення часу

 ТОБТО:
        ◦ ініціалізація таймера — це справа JavaScript й це відбувається в Call Stack
        ◦ а реалізація таймера — це вже задача браузера (Web API)

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

ІНІЦІАЛІЗАЦІЯ ТАЙМЕРА (його запуск) ОЗНАЧАЄ:

           1. створення таймера з заданою затримкою (1000 мс)

           2. реєстрація callback-функції (той код, який треба виконати після таймера)

           3. передача цієї інформації до браузера (Web APIs), щоб браузер почав відлік часу

 Цей процес відбувається синхронно в Call Stack, але сам відлік часу та переміщення callback-у — асинхронні та
 обробляються вже браузером поза Call Stack

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 РЕАЛІЗАЦІЯ ТАЙМЕРА (його виконання) — це все, що відбувається після ініціалізації, тобто:

           1. браузер починає відлік часу (наприклад, 1000 мілісекунд для setTimeout)

           2. слідкує, щоб цей час минув

           3. після закінчення часу браузер кладе callback-функцію у відповідну чергу завдань в Callback Queue

           4. і чекає, поки Event Loop зможе перемістити цю функцію у Call Stack для виконання
 ТОБТО:
        ◦ ініціалізація таймера — це його запуск за помогою JS у Call Stack (синхронна дія)

        ◦ а реалізація — це відлік часу і додавання callback у Callback Queue за помогою Web APIs в браузері
                                                                                                        (асинхронна дія)

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

                                                  Web APIs
                                             ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
                     (Application Programming Interface — Інтерфейс Програмування Додатків)

 Браузер надає набір вбудованих функцій, які дозволяють взаємодіяти з елементами сторінки, сховищем даних, подіями тощо.
 Частина з них працює асинхронно — ці інтерфейси називаються Асинхронні Web APIs.
                                                            ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 Web APIs — це зовнішні інтерфейси, які надає браузер, щоб розширити можливості JavaScript. Вони не є частиною самого
 JS, це додаткові інтрументи, які дозволяють:

    ◦ отримувати доступ до HTML елементів (DOM API)
    ◦ зберігати дані (LocalStorage)

    ◦ виконувати код з затримкою (Timer API)
    ◦ відправляти HTTP-запити (Fetch API)

    ◦ отримувати геолокацію тощо

 Багато з цих API працюють асинхронно — і саме вони беруть участь в асинхронному циклі Event Loop


‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
 ТОМУ на схемах Event Loop, середовище, в якому браузер виконує асинхронні операції позначається як Web APIs.
 Оскільки в нього потрапляють лише ті Web APIs, які працюють асинхронно — тобто ті, які беруть участь в асинхронному
 циклі Event Loop

 Синхронні ж Web APIs не беруть участі в циклі Event Loop, оскільки виконуються миттєво безпосередньо в Call Stack


 ПІДСУМОК:  Web APIs на схемах Event Loop — це:
           ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

     ◦ окремий механізм браузера, який відповідає за роботу з асинхронними операціями і працює паралельно з основним
       JS-потоком

     ◦ тобто, це частина браузера, яка виконує асинхронні операції поза JavaScript рушієм, а потім передає callback
       назад у чергу подій, яку обробляє Event Loop

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 Тож, API — це набір готових функцій, об’єктів та механізмів, які надає середовище виконання (у браузера — Web APIs,
 у Node.js — Node.js APIs).

 Вони надаються щоб полегшити взаємодію JavaScript з елементами сторінки (DOM API), зберіганням данних, надсиланням
 HTTP-запитів тощо.

                                              Основні Web API:
                                            ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

  1. DOM API  —  для роботи з елементами сторінки (HTML)  —  document object                 (sync)
        document.querySelector(),  document.getElementById() etc.

  2. Event API  —  для роботи з подіями користувача (клік, прокрутка, клавіатура)            (async)
        element.addEventListener('click', callback)

  3. Fetch API  —  для відправки HTTP-запитів                                                (async)
       fetch('/api/data').then(...)

  4. Timer API  —  для відкладеного виконання коду                                           (async)
       setTimeout(), setInterval()

  5. LocalStorage / SessionStorage API  —  для зберігання даних на стороні клієнта           (sync)
       localStorage.setItem('key', 'value'), sessionStorage.getItem('key')

  6. Console API  —  для виводу інформації в консоль браузера                                (sync)
       console.log()


‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

                                              Callback Queue
                                            ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
                                        (черга зворотніх викликів)


 Callback Queue складається з двох окремих черг:
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 1. Microtask Queue (черга мікрозадач)

    ◦ Містить задачі, які мають найвищий пріоритет після виконання синхронного коду

    ◦ Сюди потрапляють callback-и від: Promise (.then, .catch, .finally)     (microtasks  — це 99% проміси)

    ◦ Всі мікрозадачі виконуються одразу після звільнення Call Stack — перед початком виконання будь-яких макрозадач

    ◦ Якщо під час виконання мікрозадач додаються нові мікрозадачі, вони також будуть виконані перш ніж Event Loop
      перейде до макрозадач


 2. Macrotask Queue — черга макрозадач

    ◦ Містить задачі, які виконуються з нижчим пріоритетом, ніж мікрозадачі

    ◦ Сюди потрапляють callback-и від:
                                       • setTimeout, setInterval
                                       • Event Listeners (обробники подій),
                                       • HTTP-запити через Fetch API

    ◦ Event Loop виконує макрозадачу, лише коли:
                                       • Call Stack повністю звільнений (немає активного синхронного коду)
                                       • й Microtask Queue (черга мікрозадач) порожня

    ◦ Після виконання однієї макрозадачі Event Loop знову перевіряє Microtask Queue і виконує всі наявні мікрозадачі
      перш ніж переходити до наступної макрозадачі

    ◦ Цикл повторюється

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 1. setTimeout(callback, delay)
‾‾‾‾

 Це метод Web API, яка дозволяє виконати певну функцію з затримкою

 setTimeout(() => {
     console.log("After some time")
 }, 2000)


 setTimeout(callback, delay, arg1, arg2);  —  в setTimeout також можна передавати аргументи функції починаючи з
                                              третього аргументу
                                              ↓
                                              arg1, arg2 — аргументи, які будуть передані у callback
 setTimeout((name, age) => {
      console.log(`Hello, ${name}! You're ${age} years old.`)
 }, 2000, "Anna", 23)


 console.log("Start");

 setTimeout(() => { // ассинхронна операція
     console.log("After some time");
 }, 2000);

 console.log("End");     // Start
                         // End
                         // After some time


 setTimeout повертає ID таймера (число), яке дозволяє скасувати виконання таймера за допомогою clearTimeout

 const firstId = setTimeout(() => {
     console.log("After first timeout");
 }, 2000);

 clearTimeout(firstId);

 console.log(firstId); // 1


 const secondId = setTimeout(() => {
     console.log("After second timeout");
 }, 1000);

 console.log(secondId); // 2



 2. setInterval(callback, delay)
‾‾‾‾

 Це метод Web API, яка викликає функцію знову і знову через певний проміжок часу

 console.log("Start");

 const intervalId = setInterval(() => {
     console.log("After every 2 seconds");
 }, 1000);

 console.log("End");

 document.querySelector("#intervalBtn").addEventListener("click", () => {
     clearInterval(intervalId);
 })

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 TASK 1:

 for (var i = 1; i <= 5; i++) {
     setTimeout(() => {
         console.log(i);
     }, i * 1000)
 }


 Ми перезаписуємо нашу змінну var 5 разів ще до того як хоч один з setTimeout спрацював

   1. Цикл починається з i = 1

   2. setTimeout(...) реєструється, але не виконується одразу — він відкладається на i * 1000 мс

   3. Цикл іде далі: i = 2, і ще один setTimeout(...) знову реєструється. І так далі до i = 5, коли цикл зупиняється

 ❗️ Але весь цей час жоден setTimeout ще не встиг спрацювати! ❗️

 Й оскільки ми використовуємо var, а не let, вся програма працює з однією і тією ж змінною (i), яка знаходиться у
 глобальній/функціональній області видимості.

 Коли setTimeout нарешті спрацьовує, (i) вже дорівнює 5 (бо цикл вже завершився, і останнє значення, яке присвоїлося i,
 було 5).


 ВИРІШЕННЯ ПРОБЛЕМИ:
                використовувати let, бо він має блочну область видимості тому кожна setTimeout має свою власну копію (i)

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
 TASK 2:

 console.log("Start");

 setTimeout(() => {
    console.log("timeout");
 }, 0);

 console.log("End");  // Start
                      // End
                      // timeout

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 JavaScript — це мова програмування, яка сама по собі — просто текст. Щоб цей текст виконувався, потрібне середовище з
 рушієм (движком), який розуміє JavaScript і виконує його.

 Рушій (движок) JS  —  це програма, яка:
                                         ◦ читає і розбирає JS код (парсер),

                                         ◦ виконує його по кроках (інтерпретатор),

                                         ◦ і оптимізує найважливіші частини коду (JIT-компілятор),

                                         ◦ а також керує пам’яттю, змінними, викликами функцій


 приклади рушіїв:    V8 (Chrome, Node.js)      SpiderMonkey (Firefox)       JavaScriptCore (Safari)
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 Рушій V8 складається з трьох основних механізмів:

     1. Парсер — читає текст коду, перевіряє його і створює план (AST)

     2. Інтерпретатор (Ignition) — виконує цей план по кроках, швидко запускаючи код

     3. JIT-компілятор (TurboFan) — оптимізує часто використовувані частини, перетворюючи їх у швидкий машинний код

        JIT-компіляція (Just-In-Time) — це метод, при якому частини коду перекладаються у машинний код не заздалегідь,
        а прямо під час виконання програми, коли стає зрозуміло, що цей код часто використовується

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 1. Парсер

     ◦ Приймає JavaScript-код у вигляді тексту

     ◦ Перевіряє синтаксис: чи всі дужки, коми, ключові слова на місці

     ◦ Якщо є помилки — зупиняє виконання й викидає помилку

     ◦ Якщо синтаксис правильний — створює AST (Abstract Syntax Tree) — дерево, що описує структуру коду: які є функції,
       змінні, умови, цикли, виклики тощо

     ◦ AST — це план виконання коду, який далі передається інтерпретатору та компілятору

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 2. Інтерпретатор (Ignition)

     ◦ Отримує AST від парсера

     ◦ Виконує код по кроках, рядок за рядком

     ◦ Дає змогу швидко почати виконання коду без затримок (не потрібно чекати на компіляцію всього коду)

     ◦ Працює повільніше за машинний код, але швидко стартує

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 3. JIT-компілятор (TurboFan)

     ◦ Слідкує за тим, які частини коду виконуються часто (горячі ділянки)

       Горячі ділянки - це частина коду, яка виконується дуже часто або у циклі, тому її оптимізація дає найбільший
       приріст швидкості

     ◦ Перетворює ці ділянки в машинний код — інструкції, які комп’ютер розуміє напряму, без проміжних кроків

     ◦ Завдяки цьому код виконується швидше

     ◦ Постійно оптимізує код у процесі роботи, щоб робити його максимально ефективним

     Тобто:
            1. Спершу код запускає інтерпретатор (Ignition) — він швидко починає виконання

            2. Коли рушій бачить гарячу ділянку, її оптимізує JIT-компілятор, переводячи у машинний код

            3. Потім ця частина коду виконується напряму процесором — без інтерпретації


 ЯК ЦЕ ПРАЦЮЄ РАЗОМ:

   1. Спочатку парсер створює план із тексту

   2. Інтерпретатор починає виконувати цей план негайно

   3. JIT-компілятор у фоновому режимі компілює найважливіші ділянки у машинний код для прискорення


‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 Часто нам потрібно спочатку виконати асинхронну дію, а вже на її результаті — синхронну.

 Проте механізм Event Loop працює навпаки: він не чекає завершення асинхронних операцій, а продовжує виконувати
 синхроний код далі.

❗Щоб дія, яка залежить від результату асинхронної операції, виконувалась лише після її завершення, ми передаємо цю
  дію у вигляді callback-функції (до появи Promise та async/await) і викликаємо всередині тіла асинхронної операції.

 Це дозволяє запускати код, якому потрібні дані з асинхронної операції, у правильний момент — після її завершення.


EXAMPLE:

 function getUser(id, cb) {
     setTimeout(() => {  // імітація запиту на сервер
         console.log("User found!")
         const user = {id, name: "Alex"}  // отримані дані з бекенду
         cb(user)  // викликаємо callback з отриманими даними
     }, 1000);
 }

 function displayUserData(user) {
     console.log(`HTML for ${user.name}`)
 }

 getUser(5, displayUserData); // User found!
                              // HTML for Alex


                                                  Callback hell
                                               ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
проблема коли для виконання послідовних асинхронних операцій використовують велику кількість вкладених callback-функцій


function getUser(id, callback) {
    setTimeout(() => {   // імітація запиту на сервер
        console.log("User found!")
        const user = {id, name: "Alex"}
        callback(user) // вона буде викликана всередині асинхронної операції (у setTimeout)  (2)
    }, 1000);
}

function getPosts(id, callback) {
    setTimeout(() => {
        console.log("Posts found!")
        callback(["post 1", "post 2"])  // функція callback спрацьовує після того, як користувача буде знайдено — бо ми
    }, 2000);                          // її викликаємо всередині setTimeout, через 2 секунди
}

function getComments(id, callback) {
    setTimeout(() => {
        console.log("Comments found!")
        callback(["comment 1", "comment 2"])
    }, 3000);
}

getUser(1, function(user) { //  передаємо другим аргументом анонімну функцію - callback  (1)

    getPosts(user, function(posts) {  // всередині цієї анонімної функції ми викликаємо наступну функцію (3)
                                     // й знову другим аргументом передаємо анонімну функцію - callback
        getComments(posts[0], function(comments) {
            console.log("Comments for the first post:", comments)
        })
    })
})         // User found!
           // Posts found!
           // Comments found!
           // Comments for the first post: ["comment 1", "comment 2"]


‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
 МИ НАМАГАЄМОСЯ ЗРОБИТИ ПОСЛІДОВНИМИ (синхронними) ДІЇ, ЯКІ Є АСИНХРОННИМИ

     Бо нам важливо:

          1. Спочатку отримати користувача (getUser)

          2. Коли він буде готовий — тільки тоді отримати його пости (getPosts)

          3. Коли будуть пости — тільки тоді отримати коментарі до першого поста (getComments)

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
 ЯКЩО НАПИСАТИ БЕЗ ВКЛАДЕНЬ:        getUser(1, handleUser)
                                    getPosts(user, handlePosts)
                                    getComments(post, handleComments)
 JavaScript:
    1. запускає getUser

    2. бачить setTimeout(...)  →  ставить таймер на 1000 мс

    3. й просто йде далі до getPosts, не чекаючи, поки getUser завершиться

 Але getPosts(user) виконується на результаті getUser, тобто getPosts(user) очікує отримати як аргумент результат
 виконання функції getUser - user.

 Й getPosts(user) очікує, що user вже є, але getUser ще не завершився, тобто результату ще немає.

 ❗Результат getUser прийде лише через 1 секунду ❗
 А виклик getPosts(user) трапився миттєво — тому він отримує undefined, null або щось некоректне.

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
 Тому єдиний спосіб працювати з асинхронністю у JS (до появи Promises та async/await) —  це передавати callback-функцію
 як аргумент, яка не викликається одразу, а ПІЗНІШЕ — коли асинхронна операція (setTimeout, бекенд-запит) завершиться.

 Бо ми кладемо цю функцію всередину тіла асинхронної операції, і вона буде викликана саме тоді, коли результат стане
 доступним.


                                   CALLBACK HELL ПЕРЕПИСАНИЙ З ПРОМІСАМИ
                                  ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

function getUser(id) {
    return new Promise((resolve, reject) => {
        setTimeout(()=> {
            const user = {id, name: "Alex"}

            if(user){
                resolve(user)
            } else {
                reject("User not found!")
            }

        },3000)
    })
}

function getPosts() {
    console.log("User found!");

    return new Promise((resolve, reject) => {
        setTimeout(()=> {
            const posts = ["post 1", "post 2"]
            if(posts){
                resolve(posts)
            } else {
                reject("Posts not found!")
            }
        }, 2000)
    })
}

function getComments() {
    console.log("Posts found!");
    return new Promise((resolve, reject) => {
        setTimeout(()=> {
            const comments = ["comment 1", "comment 2"]
            if(comments){
                resolve(comments)
            } else {
                reject("Comments not found!")
            }
        }, 1000)
    })
}


getUser(1)
.then(user => getPosts(user))
.then(posts => getComments(posts[0]))
.then(comments => {
    console.log("Comments found!");
    console.log("Comments for the first post:", comments)
})
.catch(err => {
    console.log(err)
})


‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

                                             Promise (Проміс)
                                            ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
                          він був доданий в JS у стандарті ES6 (ECMAScript 2015)


 ◦ Promise — це стандартна функція-конструктор у JS (або вбудований об’єкт, бо кожна функція є екземпляром об'єкта
   Function.prototype)

 ◦ Викликаючи new Promise(), ми створюємо екземпляр об'єкта, прототипом якого є Promise.prototype

 ◦ Завдяки цьому кожний об'єкт, створений через new Promise, успадковує методи .then(), .catch(), .finally()
   від Promise.prototype

           АЛЕ ПРОМІСОМ НАЗИВАЮТЬ НЕ КОНСТРУКТОР Promise, А ОБ'ЄКТ ЯКИЙ БУВ СТВОРЕНИЙ ЧЕРЕЗ ЦЕЙ КОНСТУКТОР


 Promise — це об’єкт в JS, який зберігає в собі результат асинхронної операції, який буде доступний у майбутньому.

 Поки Promise у стані pending (тобто асинхронна дія ще не завершена), він не містить ні даних, ні помилки — лише
 внутрішню обіцянку, що одне з цих буде.

                                           ЩО ЗНАХОДИТЬСЯ В ПРОМІСІ
                                         ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 1. Проміс — це об’єкт, який спочатку має внутрішній стан pending та внутрішнє значення (обіцянку) — цього значення ще
    немає, бо асинхронна операція не завершена

 2. Коли асинхронна операція завершить своє виконання й поверне результат, на якому спрацює перевірка, яка в свою чергу
    викличить одну з двох функцій — resolve(value) або reject(error).

    Виклик однієй з цих функцій змінить стан промісу з pending на fulfilled або rejected, в залежності від того що
    спрацює:

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
    ТОБТО:

      ◦ коли викликається resolve(value), цей value стає внутрішнім значенням проміса і змінює його стан на fulfilled
                                                    ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
      ◦ аналогічно, коли викликається reject(error), error стає внутрішнім значенням проміса і змінює стан на rejected

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
    ОТЖЕ, В ПРОМІС ЗБЕРІГАЄ В СОБІ:

       ◦ Стан (pending, fulfilled, rejected)
       ◦ Внутрішнє значення (дані або помилку), які передаються через resolve(value) або reject(error)

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 3. Коли стан змінюється з pending на fulfilled, проміс передає внутрішнє значення (те, що передали в resolve) у всі
    функції, зареєстровані через .then() як аргумент

    Якщо стан змінюється на rejected, внутрішня помилка передається як аргумент у функції, зареєстровані через .catch()

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

                                         .then()  .catch()  .finally()
                                         ‾‾‾‾‾‾‾‾ ‾‾‾‾‾‾‾‾‾ ‾‾‾‾‾‾‾‾‾‾

 Це методи промісу, які він успадковує від Promise.prototype при створенні через конструктор Promise

 Вони дозволяють ОБРОБЛЯТИ РЕЗУЛЬТАТ АСИНХРОННОЇ ОПЕРАЦІЇ, тобто виконувати дії після завершення цієї операції — як у
 разі успіху, так і у разі помилки

 СИНТАКСИС:
             getData()
               .then((data) => {
                   console.log("User found!")
                   return data
               });

 На промісі, який повернула функція getData(), який ще знаходиться в стані pending, викликаємо перший метод — then(),
 в який як аргумент передаємо callback-функцію. В ній ми можемо виконувати подальші дії з отриманими даними з асинхронної функції.


‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

                                       СИНТАКСИС СТВОРЕННЯ promise (обіцянки)

 function getData() {
   return new Promise((resolve, reject) => {

     setTimeout(() => {     // імітація асинхронної операції, наприклад запит до сервера

        const response = {  // імітація збереження в змінну даних, отриманих у відповідь з бекенду
            success: true,
            data: {
              name: "Anna",
              isAdmin: true
            }
        };

        if (response.success) {
           resolve(response.data);
        } else {
           reject(new Error("Data is not found"));
        }

     }, 1000); // setTimeout

   });         // executor
 }             // getData


‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
 1. function getData() {}  —  оголошуємо функцію

     ЗАЗВИЧАЙ ПРОМІС СТВОРЮЄТЬСЯ ВСЕРЕДИНІ ФУНКЦІЇ, І ЦЯ ФУНКЦІЯ ПОВЕРТАЄ ЙОГО ЯК РЕЗУЛЬТАТ

     Цей проміс зберігає в собі результат асинхронної операції, який буде доступний у майбутньому

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
 2. return new Promise((resolve, reject) => {})

         2.1  new Promise()   —  за допомогою конструктора Promise створюємо об’єкт — проміс зі станом pending

         2.2  Promise((resolve, reject) => {})  —  у конструктор Promise передається синхронна функцію executor
              як аргумент, яка:

                   ◦ потрапивши в конструктор, одразу починає виконуватись
                   ◦ приймає два параметри: resolve і reject

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾   ↓ ↓ ↓   ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
  JS АВТОМАТИЧНО:
                  1. створює функції resolve та reject й передає їх у executor як аргументи

                  3. після цього викликає executor в тілі конструктора Promise


 УСЕ ВІДБУВАЄТЬСЯ АВТОМАТИЧНО, без нашої прямої участі. Ми лише даємо логічні імена двом аргументам (resolve та reject),
 які автоматично передаються в executor.

 Це дає нам доступ до цих функцій і можливість викликати їх у потрібний момент — а саме при перевірці умови.

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
 3. setTimeout(() => {}, 1000)  —  також у функцію executor передаємо асинхронну операцію (наприклад, setTimeout)

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
 4. const response = {
        success: true,
        data: {
          name: Anna,
          isAdmin: true
        }
    };

  Отримані дані з асинхронної операції (наприклад, з сервера) спочатку зберігаємо в змінну, а вже потім перевірємо

  Зазвичай бекенд надсилає у відповідь об’єкт, який містить два поля:

        ◦ success (або status, ok, error) — показує, чи була операція успішною (true або false)
        ◦ data — самі дані, які повертаються (у вигляді об'єкту), або null, якщо сталася помилка

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
 5. if (response.success) {
        resolve(response.data);
      } else {
        reject(new Error("Data is not found"));
      }
  }, 1000);

  Встановлюємо перевірку результату асинхронної операції (response). Залежно від значення поля success, викликаємо
  resolve або reject:

        ◦ якщо response.success === true  —  операція завершилася успішно  —  викликаємо resolve(response.data) — це
          повідомляє проміс, що операція виконана і результат value доступний
           ↓ ↓ ↓
          Проміс змінює свій стан з pending на fulfilled

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
       ❗ У resolve ми передаємо результат асинхронної операції — це можуть бути будь-які дані, які ми отримали,
                              наприклад, відповідь від сервера при HTTP-запиті
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

        ◦ якщо response.success === false — сталася помилка, викликаємо reject(value), де value — це повідомлення про
          помилку
           ↓ ↓ ↓
          Проміс змінює свій стан з pending на rejected

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
 6. PROMISE ЗАВЖДИ МАЄ ОДИН З ТРЬОХ СТАНІВ:

          ◦ pending   —  очікування (асинхронна операція триває)

          ◦ fulfilled —  асинхронна операція успішно завершена, дані доступні

          ◦ rejected  —  операція завершилася з помилкою

 Внутрішній механізм промісу відслідковує ці стани та реагує на виклики resolve або reject:

          1. Спочатку проміс у стані pending (очікування)

          2. Виклик resolve переводить його у fulfilled (виконано)

          3. Після reject — у rejected (відхилено)


‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

                                      СИНТАКСИС ОБРОБКИ РЕЗУЛЬТАТУ

  getData()
  .then(data => {       // обробка успішного результату
    console.log(data);
  })
  .catch(error => {    // обробка помилки
    console.log(error);
  })
  .finally(() => {    // виконується завжди — успіх чи помилка
    console.log("Завершено");
  });


‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 1. getData()  —  викликаємо функцію getData(), яка повертає проміс. Цей проміс має стан pending і внутрішнє значення,
    яке поки недоступне

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
 2. На промісі, який повернула функція getData(), будуємо ланцюжок викликів методів .then(), .catch() і .finally()

    Кожен з цих методів приймає як аргумент функцію-callback, яка буде далі виконувати необхідні нам дії з внутрішнім
    значенням промісу


‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

                                           ВЗАЄМОДІЯ EVENT LOOP З ПРОМІСОМ


 function getData() {
   return new Promise((resolve, reject) => {

     setTimeout(() => {     // Імітація асинхронної операції, наприклад запит до сервера

        const response = {  // Імітація збереження в змінну даних, отриманих у відповідь з бекенду
            success: true,
            data: {
              name: "Anna",
              isAdmin: true
            }
        };

        if (response.success) {
           resolve(response.data);
        } else {
           reject(new Error("Data is not found"));
        }

     }, 1000);

   });
 }


 getData()
   .then(data => {       // обробка успішного результату
     console.log("User found!")
     return data
   })
   .catch(error => {    // обробка помилки
     console.log(error);
   })
   .finally(() => {    // виконується завжди — успіх чи помилка
     console.log("Завершено");
   });



 1.  JS починає однопотоково зчитувати код зверху вниз

 2. Викликається функція getData()  →  потрапляє в Call Stack

 3. JS переходить до тіла функції й починає покроково виконувати код

      ◦ Через new викликається конструктор Promise, в який ми передаємо один аргумент — функцію executor, яка приймає
        два параметри: resolve і reject

              JS під капотом автоматично створює ці дві функції (resolve та reject) й передає їх у executor як
              аргументи

              ТОБТО:
                    Ми не створюємо resolve і reject самі — ми лише даємо логічні назви цим двом функціям, які
                    передаються як аргументи, щоб мати змогу викликати їх у потрібний момент — при перевірці умови


     ◦ Конструктор створює новий об’єкт-проміс зі станом pending

              Коли проміс створюється за допомогою new Promise(), він автоматично отримує початковий стан pending

              Це означає, що проміс ще не має результату — він очікує завершення асинхронної операції


      ◦ Після того як ми передаємо функцію executor як аргумент у конструктор Promise, JS автоматично викликає її
        всередині конструктора й переходить до виконання коду в її тілі:

               • Синхронна функція setTimeout викликається  —  ІНІЦІЮЄТЬСЯ ТАЙМЕР:

                          1. створюється таймер із заданою затримкою (1000 мс)
                                                                                                                       │
                          2. реєструється callback (асинхронна функція, яку треба виконати після затримки)             │
                                                                                                                       │
                          3. цей callback і таймер передаються браузеру (Web APIs),                          ──────────┘
                             щоб браузер почав відлік часу                                                      ─────►       ПОЧИНАЄТЬСЯ АСИНХРОННА ОПЕРАЦІЯ
                                                                                                             ──────────┐
                                                                                                                       │
               • setTimeout, а за нею і executor завершують своє виконання й видаляються з Call Stack                  │     4. Реалізація таймера в Web APIs
                                                                                                                       │
      ◦ Функція getData повертає, як результ свого виконання, новостворений проміс. Він має стан pending і внутрішнє   │           ◦ Браузер запускає відлік часу (1000 мс)
        значення, яке поки недоступне                                                                                  │
                                                                                                                       │           ◦ Після завершення таймера callback-функція (та, що була передана як аргумент у setTimeout) переміщується в
              Але під час створення проміса в його конструктора передається функція (executor), яка автоматично        │             Macrotask Queue (Callback Queue)
              викликається одразу, як тільки потрапляє до конструктора.                                                │
                                                                                                                       │           ◦ Там вона чекає поки:
              Всередині неї пізніше має спрацювати виклик однієї з двох функцій — resolve або reject                   │                  • Call Stack повністю звільниться
              Й одна з них:                                                                                            │                  • Будуть виконані всі задачі з Microtask Queue - він і так порожній
                           ◦ або передасть результат - дані (якщо resolve)                                             │
                           ◦ або передасть помилку (якщо reject)                                                       │           ◦ АЛЕ CALL STACK ЗАРАЗ ЗАЙНЯТИЙ (В НЬОМУ ПРОДОВЖУЄТЬСЯ ВИКОНАННЯ СИНХРОННИХ ЗАДАЧ) ТОЖ CALLBACK ЧЕКАЄ
                                                                                                                       │
              Це значення — результат (дані), або помилка — і стане внутрішнім значенням проміса, але поки його немає  │
                                                                                                                       │
       • Після повернення промісу getData завершує своє виконання й видаляється з Call Stack                           │
                                                                                                                       │   Waiting...
                                                                                                                       │
 НЕ ЧЕКАЮЧИ НА ЗАВЕРШЕННЯ АСИНХРОННОЇ ОПЕРАЦІЇ JS ЙДЕ ДАЛІ ПО КОДУ                                                     │
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾                                                   │
                                                                                                                       │
 4. На промісі, який повернула функція getData(), прописаний ланцюжок викликів методів .then(), catch() і finally()    │
                                                                                                                       │
        Method chaining (або Promise chaining) — це коли викликається кілька методів один за одним, і кожен наступний  │
        метод викликається на результаті попереднього                                                                  │
                                                                                                                       │
                                         ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾│
                                           ТОБТО ЦЕ:                        ТЕЖ САМЕ ЩО:                               │
                                                     getData()                           getData().then.catch.finally  │
                                                     .then(data => {})                                                 │
                                                     .catch(error => {})                                               │
                                                     .finally(() => {});                                               │
                                                                                                                       │
                                         ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾│   Waiting...
                                                                                                                       │
        КОЖЕН ІЗ ЦИХ МЕТОДІВ  then(), catch(), finally():                                                              │
                                                                                                                       │
                 ◦ приймає як аргумент функцію-callback, яка буде далі виконувати потрібні нам дії з внутрішнім        │
                   значенням промісу. ЦЕЙ CALLBACK НЕ ВИКОНУЄТЬСЯ ОДРАЗУ, ВІН ЧЕКАЄ НА ЗМІНУ СТАНУ ПРОМІСУ             │
                                                                                                                       │
                 ◦ ПОВЕРТАЄ НОВИЙ ПРОМІС, саме на ньому буде викликано наступний метод в ланцюжку                      │
                                                                                                                       │
                                                                                                                       │   Waiting...
 5. JS ПОЧИНАЄ ОБРОБЛЯТИ ЦЕЙ PROMISE CHAINING:                                                                         │
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾                                                                        │
                                                                                                                       │
 5.1 Спочатку на отриманому промісі викликається метод then(), в який як аргумент передається callback-функція         │
                                                                                                                       │
              Цей callback приймає один параметр — це значення, яке буде передано у resolve(result) у випадку          │
              успішного виконання асинхронної операції. АЛЕ НА МОМЕНТ РЕЄСТРАЦІЇ ФУНКЦІЇ ЦЕ ЗНАЧЕННЯ ЩЕ НЕВІДОМЕ       │
                                                                                                                       │
     ◦ Оскільки оригінальний проміс поки має стан pending, JS лише реєструє callback як обробник (success handler),    │
       АЛЕ НЕ ВИКОНУЄ ЙОГО                                                                                             │   Waiting...
                                                                                                                       │
             Ця callback-функція почне своє виконання лише після виклику resolve(result) у тілі промісу (точніше — у   │
             функції executor), який переведе проміс у стан fulfilled (успішно завершений)                             │
                                                                                                                       │
             Після виклику resolve() callback потрапить у чергу мікрозадач (Microtasks Queue) й буде виконаний після   │
             завершення всього синхронного коду в Call Stack                                                           │
                                                                                                                       │
                                                                                                                       │
            Реєстрація callback-функції як обробника                                                                   │   Waiting...
            ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾                                                                   │
             ◦ JavaScript не виконує callback одразу                                                                   │
                                                                                                                       │
             ◦ Він лише зберігає його всередині промісу у спеціальний список очікування — ВНУТРІШНІЙ СПИСОК ОБРОБНИКІВ │
                                                                                                                       │
                 Внутрішній список обробників — це структура всередині кожного промісу, куди JS записує                │
                 callback-функції, які ми предаємо у then(), catch(), та finally()                                     │
                                                                                                                       │
                 Вони не виконуються одразу, а лише реєструються та чекають, поки проміс змінить свій стан             │
                                                                                                                       │   Waiting...
                 ТОБТО:                                                                                                │
                        Якщо проміс ще в стані pending, callback (той, який був переданий в його наступний метод),     │
                        зберігається у Внутрішньому Списку Обробників промісу, до того моменту, поки він не змінить    │
                        свій стан на fulfilled або rejected.                                                           │
                                                                                                                       │
                                                                                                                       │
     ◦ Після того як JS реєструє callback методу .then(), метод повертає новий об’єкт-проміс:                          │
                                                                                                                       │
            • цей новий проміс автоматично створюється всередині методу .then()                                        │
                                                                                                                       │
            • він також має стан pending й внутрішнє значення (дані або помилку), яке теж ще не визначене              │   Waiting...
                                                                                                                       │
                                                                                                                       │
                                                                                                                       │
                           Promise (2)                                                                                 │
                          ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾│
                                                                                                                       │
                          1. Стан промісу, який повертає метод then() зміниться лише після того, як оригінальний       │
                             проміс завершиться викликом resolve(result) або reject(error).                            │
                                                                                                                       │
                             Виклик resolve(result) переведе оригінальний проміс у стан fulfilled                      │   Waiting...
                                                                                                                       │
                                                                                                                       │
                          2. Ця зміна стану активує виконання success handler, який зберігається у Внутрішньому Списку │
                             Обробників промісу. Success handler — callback, який ми передали у метод .then()          │
                                                                                                                       │
                             Цей callback приймає один аргумент — внутрішнє значення промісу у внутрішньому списку     │
                             якого він зберігається, тобто результат успішного виконання асинхронної операції — дані   │
                                                                                                                       │
                             resolve(response.data)  →  then((data) => {})     response.data передається у data        │
                                                                                                                       │   Waiting...
                                                                                                                       │
                          3.  Результат виконання цього callback стане внутрішнім значенням промісу, який було         │
                              повернуто методом .then()                                                                │
                                                                                                                       │
                                                                                                                       │
                                                                                                                       │
                           МЕТОДИ then(), catch() і finally() ЗАВЖДИ ПОВЕРТАЮТЬ НОВИЙ ПРОМІС                           │
                          ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾│
                                                                                                                       │   Waiting...
                          Навіть якщо всередині callback-функції ми повертаємо звичайне значення (число, рядок, об'єкт)│
                                                                                                                       │
                          ТОБТО:                                                                                       │
                                 Якщо callback всередині then() повертає звичайне значення, воно автоматично           │
                                 обгортається в проміс                                                                 │
                                                                                                                       │
                                                                                                                       │
                          НАПРИКЛАД:                                                                                   │
                                                                                                                       │   Waiting...
                          1. Наш callback повертає об'єкт — return data                                                │
                                                                                                                       │
                          2. JS автоматично перевіряє, чи це значення є промісом:                                      │
                                                                                                                       │
                                ◦ Якщо так  —  нічого не робить                                                        │
                                                                                                                       │
                                ◦ Якщо ні  —  JS автоматично обгортає його у проміс,                                   │
                                  ТОБТО замінює рядок return data  на  return Promise.resolve(data)                    │
                                                      ‾‾‾‾‾‾‾‾‾‾‾      ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾                    │
                                                                                                                       │   Waiting...
                          Promise.resolve(data) — це статичний метод конструктора Promise, який:                       │
                                                                                                                       │
                                 1. автоматично створює новий об'єкт-проміс                                            │
                                                                                                                       │
                                 2. одразу переводить його в стан fulfilled                                            │
                                                                                                                       │
                                 3. й встановлює data як його внутрішнє значення                                       │
                                                                                                                       │
                                                                                                                       │
 5.2  На отриманому промісі з then(), викликається наступний метод catch(), в який як аргумент вже передається своя    │   Waiting...
      callback-функція — обробник помилки                                                                              │
                                                                                                                       │
              Цей callback приймає один параметр — це значення, яке буде передано у reject(error) у випадку            │
              помилки виконання асинхронної операції. НА МОМЕНТ РЕЄСТРАЦІЇ ФУНКЦІЇ ЦЕ ЗНАЧЕННЯ ЩЕ НЕВІДОМЕ.            │
                                                                                                                       │
     ◦ Оскільки проміс, отриманий з then(), поки у стані pending, JS лише реєструє callback як обробник (error handler)│
       ТОБТО:                                                                                                          │
             зберігає його у ВНУТРІШНІЙ СПИСОК ОБРОБНИКІВ всередині промісу, який нам повернув метод then()            │   Waiting...
                                                                                                                       │
       JS ЛИШЕ РЕЄСТРУЄ CALLBACK ЯК ОБРОБНИК, АЛЕ НЕ ВИКОНУЄ ЙОГО                                                      │
                                                                                                                       │
             Цей callback почне своє виконання лише коли проміс, повернутий через then() змінить свій стан з pending   │
             на rejected                                                                                               │
                                                                                                                       │
             Після зміни стану промісу callback потрапить у Microtasks Queue й буде виконаний після завершення усього  │
             синхронного коду в Call Stack                                                                             │
                                                                                                                       │   Waiting...
                                                                                                                       │
     ◦ Після того як JS реєструє callback методу .catch(), метод повертає новий об’єкт-проміс:                         │
                                                                                                                       │
            • цей новий проміс автоматично створюється всередині методу .catch()                                       │
                                                                                                                       │
            • він також має стан pending й внутрішнє значення (дані або помилку), яке теж ще не визначене              │
                                                                                                                       │
                                                                                                                       │
 5.3  На отриманому промісі з catch(), викликається останній метод finally(), в який як аргумент передається CALLBACK, │   Waiting...
      ЯКИЙ ВИКОНУЄТЬСЯ ЗАВЖДИ — незалежно від того, на який стан (fulfilled або rejected) буде змінений проміс,        │
      повернутий методом catch()                                                                                       │
                                                                                                                       │
              Цей callback не приймає жодних аргументів — він ніколи не дізнається, чи стався успіх (resolve),         │
              чи помилка(reject), бо не залежить від цього                                                             │
                                                                                                                       │                                                                                                                       │
              ЙОГО ОСНОВНЕ ПРИЗНАЧЕННЯ — ВИКОНАТИ ЗАВЕРШАЛЬНІ ОПЕРАЦІЇ, НАПРИКЛАД:                                     │
                                                                                                                       │
                   • Очистити інтерфейс                                                                                │
                      Тобто, прибрати якісь тимчасові елементи з екрана, які з’явилися під час операції                │   Waiting...
                      Наприклад, якщо під час завантаження даних показується повідомлення "Downloading…"               │
                                                                                                                       │
                   • Прибрати лоадер (loader — це анімація, іконка або індикатор завантаження)                         │
                       Його зазвичай показують, поки користувач чекає на результат                                     │
                                                                                                                       │
                                                                                                                       │
     ◦ Оскільки проміс, отриманий з catch(), поки має стан pending, JS лише реєструє callback як обробник завершення   │
       (finalizer), АЛЕ НЕ ВИКОНУЄ ЙОГО                                                                                │
                                                                                                                       │
       ТОБТО:  Зберігає його у ВНУТРІШНІЙ СПИСОК ОБРОБНИКІВ всередині промісу, який нам повернув метод catch()         │   Waiting...
                                                                                                                       │
                                                                                                                       │
             Цей callback буде виконаний завжди, незалежно від того, у який стан перейде проміс, отримний з catch(),   │
             (fulfilled чи rejected)                                                                                   │
                                                                                                                       │
             В будь-якому з цих випадків — callback потрапить у Microtasks Queue й буде виконаний після завершення     │
             синхронного коду в Call Stack                                                                             │
                                                                                                                       │
                                                                                                                       │
 6. JS ЗАКІНЧУЄ ОБРОБКУ ЛАНЦЮЖКА ВИКЛИКІВ МЕТОДІВ, після того як створив 3 додаткові проміси й зареєстрував три колбеки│   Waiting...
    з методів then(), catch(), finally(), тобто додав у Внутрішні Списки Обробників                                    │
                                                                                                                       │
    ↓ ↓ ↓                                                                                                              │
                                                                                                                       │
──────────────────────────────                                                                                         │
   Таким чином, JS створив ЛАНЦЮЖОК ПРОМІСІВ з чотирьох промісів, кожен із яких чекає, коли попередній проміс змінить  │
   свій стан та отримає внутрішнє значення                                                                             │
                                                                                                                       │
                                                                                                                       │
       original promise  —  зберігає колбек, переданий у .then()                                                       │
        ↓                                                                                                              │   Waiting...
       promise, повернутий через .then()  →  promise 2  —  зберігає колбек, переданий у .catch()                       │
        ↓                                                                                                              │
       promise, повернутий через .catch()  →  promise 3  —  зберігає колбек, переданий у .finally()                    │
        ↓                                                                                                              │
       promise, повернутий через .finally() → promise 4                                                                │
                                                                                                                       │
                                                                                                                       │
   У Внутрішньому Списку Обробників кожного з цих промісів (крім того, який повернув метод finally) зберігається       │
   callback, який був переданий у наступний метод.                                                                     │
                                                                                                                       │   Waiting...
   Цей callback буде передано в Microtask Queue лише після того, як:                                                   │
                                                                                                                       │
         ◦ проміс, у Внутрішньому Списку Обробників якого зберігається цей коллбек, завершиться                        │
          (змінить стан на fulfilled або rejected)                                                                     │
                                                                                                                       │
         ◦ й отримає внутрішнє значення  →  це значення передасться як аргумент до колбеку, який вже зберігається у    │
                                            Внутрішньому Списку Обробників цього промісу                               │
──────────────────────────────                                                                                         │
                                                                                                             ──────────┘
 7. Call Stack очищується й оскільки синхронного коду далі більше немає, залишається порожнім                   ─────►        CALL STACK ПОРОЖНІЙ
                                                                                                             ──────────┐            ↓
                                                                                                                       │      5. Event Loop перевіряє Microtask Queue (чергу мікрозадач)  →  теж порожня
                                                                                                                       │            ↓
                                                                                                                       │      6. Event Loop перевіряє Macrotask Queue (чергу макрозадач)  →  Там очікує callback від setTimeout
                                                                                                             ──────────┘
                                                                                                                ◄─────        7. EVENT LOOP ПЕРЕМІЩУЄ CALLBACK У CALL STACK ДЛЯ ВИКОНАННЯ
                                                                                                             ──────────┐
 8. Виконання callback-функції в Call Stack                                                                            │
                                                                                                                       │
       ◦ callback потрапляє в Call Stack  →  JS переходить до тіла функції й починає покроково виконувати код          │
                                                                                                                       │
       ◦ Створюється змінна (response) в яку зберігаються дані, отримані як результат асинхронної операції             │

                Наприклад, бекенд зазвичай надсилає у відповідь об’єкт, який містить два поля:

                    • success (або status, ok, error) — показує, чи була операція успішною (true або false)
                    • data — самі дані, які повертаються (у вигляді об'єкту), або null, якщо сталася помилка


 9. ПОЧИНАЄ ВИКОНУВАТИСЬ УМОВА — відбувається перевірка результату асинхронної операції (response).

             Залежно від значення поля success, викликається resolve(response.data) або reject(error)
                                                             ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾     ‾‾‾‾‾‾‾‾‾‾‾‾‾
             Це СИНХРОННІ callback-функції, які автоматично передаються у executor як аргументи при створенні промісу,
             й використовуються для зміни його стану:

                      • виклик resolve(value) —  змінює стан промісу з pending на fulfilled
                      • виклик reject(error)  —  змінює стан промісу з pending на rejected


      ◦ Якщо операція успішна (response.success === true)  ───►  викликається функція resolve(response.data)
        й ВІДБУВАЄТЬСЯ ЗМІНА СТАНУ ПРОМІСУ на fulfilled (виконано)

      ◦ Якщо сталася помилка  (response.success === false) ───►  викликається reject(new Error("Data is not found"))
        й ВІДБУВАЄТЬСЯ ЗМІНА СТАНУ ПРОМІСУ на rejected (відхилено)


 10. Коли оригінальний проміс переходить у стан fulfilled:

      ◦ Callback, який зберігається в його Внутрішньому Списку Обробників переносяться в Microtask Queue

       В Microtask Queue ПОТРАПЛЯЮТЬ ЛИШЕ ДВА CALLBACK-И:
                                                          • колбек з .then(), або .catch()
                                                          • та колбек з .finally() (завжди)

НАРИКЛАД:

         10.1  В оригінальному промісі спрацьовує функція reject(error) й

                   ◦ проміс переходить у стан rejected
                   ◦ й його внутрішнім значенням стає аргумент виклику reject(error)  —  ПОВІДОМЛЕННЯ ПРО ПОМИЛКУ

         10.2  Оригінальний проміс зберігає callback, переданий у метод then(), як success handler у своєму Внутрішньому
               Списку Обробників

         10.3  Оскільки проміс перейшов у стан rejected, його success handler не переноситься в Microtask Queue й
               не виконується

         10.5  НАТОМІСТЬ:
                          ◦ проміс, який повернув then() — promise 2, автоматично переходить у стан rejected,

                          ◦ й його внутрішнім значенням стає внутрішнє значення оригінального промісу,
                            тобто аргумент виклику reject(error)  —  ПОВІДОМЛЕННЯ ПРО ПОМИЛКУ


         10.6  Проміс, який повернув then() — promise 2, також зберігає у своєму Внутрішньому Списку Обробників callback
               який був переданий у метод catch(), як error handler

         10.7  Оскільки promise 2 отримав стан rejected, його error handler переноситься в Microtask Queue, де очікує
               свого виконання


 11. Event Loop перевіряє Call Stack, й якщо він порожній, переходить до обробки Microtask Queue

 ВАЖЛИВО: Event Loop не чекає, доки всі callback-и потраплять в Microtask Queue — він одразу починає обробляти їх по
          черзі, щойно Call Stack стає порожнім


         11.1  Event Loop переносить error handler з Microtask Queue у Call Stack

         11.2  Потрапивши в Call Stack, callback починає виконуватись

         11.3  ЗМІНА СТАНУ ПРОМІСА, ЯКИЙ ПОВЕРНУВ .catch()  — promise 3

               ◦ Якщо error handler повертає значення або undefined, як результат виконання:

                       • promise 3 переходить у стан fulfilled

                       • й внутрішнім значенням цього промісу (яке досі було невідоме) стає результат виконання error
                         handler

                ◦ Якщо error handler викидає помилку (throw або необроблений Error):

                       • проміс переходить у стан rejected з причиною цієї помилки — rejected (reason)


  ТОБТО:
         Після виконання error handler, promise 3 змінює свій стан та отримує внутрішнє значення (або причину помилки),
         яке до цього моменту залишалось невідомим.



 12. Виконання останнього колбеку, який був переданий у .finally

         12.1  Проміс, який повернув .catch() — promise 3, також зберігає у своєму Внутрішньому Списку Обробників
               callback, переданий у метод finally(), як finalizer (обробник завершення)

         12.2  Оскільки promise 3 змінив свій стан та отримав внутрішнє значення
                ↓
               finalizer переноситься в Microtask Queue де очікує свого виконання

         12.3  Event Loop перевіряє Call Stack, й якщо він порожній, переносить finalizer з Microtask Queue у Call Stack

         12.4  Потрапивши в Call Stack, callback починає виконуватись


 13. Значення яке повертає finalizer ІГНОРУЄТЬСЯ. Оскільки проміс, який повертає .finally() — promise 4, успадковує
      стан і значення від promise 3

      Є ЄДИНИЙ ВИЙНЯТОК, якщо finalizer:
                                        ◦ кине помилку (throw),
                                        ◦ або поверне проміс, який у стані rejected

     ТОДІ, promise 4 стане rejected, і його внутрішнім значенням буде нова помилка, а не те, що було у promise 3


 ЛОГІЧНЕ ЗАВЕРШЕННЯ ЛАНЦЮЖКА ПРОМІСІВ


‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
                                                     Error
                                                   ‾‾‾‾‾‾‾‾‾
 Error — це вбудований клас у JS, який викликається чрез new для створення екземплярів об’єктів-помилок.
 Такі об’єкти мають доступ до трьох основних властивостей з Error.prototype: name, message та stack.
                                                                             ‾‾‾‾  ‾‾‾‾‾‾‾‾   ‾‾‾‾‾‾

       ◦ message — опис помилки (це рядок, який ми передаємо як аргумент при виклику класу Error через new

       ◦ name — назва типу помилки (за замовчуванням "Error", але її можна змінити вручну через error.name = "NewError")

       ◦ stack — стек викликів (містить інформацію про те, де саме у коді сталася помилка (номер рядку, назву файлу)


 СИНТАКСИС:  new Error([message])

       const error = new Error("Data is not found");

       console.log(error.name);     // Error
       console.log(error.message);  // Data is not found

       console.log(error.stack);    // Error: Data is not found
                                    // at main.js:1004 (рядок де виникла помилка)


 ❗️Об'єкти-помилки, створені через new Error(message), часто використовуються в промісах.
   Вони передаються як аргумент у виклик колбеку reject() при перевірці результату асинхронної операції.

 EXAMPLE:

        if (response.success) {
             resolve(response.data);
        } else {
             reject(new Error("Data is not found"));
        }


‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾*/




