                                                                                                                      /*
 JavaScript і парадигми програмування
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
 JavaScript — мультипарадигмова мова. Тобто це мова, яка підтримує кілька стилів (парадигм) програмування, і
 дозволяє вільно комбінувати їх у межах одного проєкту.

 Парадигма — це стиль або підхід до того, як ми організовуємо код

 ЯКІ САМЕ ПАРАДИГМИ МОЖНА ВИКОРИСТОВУВАТИ В JS:

 ◦ Об'єктно-орієнтоване програмування (ООП) — через об'єкти, прототипи, класи

 ◦ Функціональне програмування (ФП) — через функції, замикання

 ◦ Імперативний стиль — як у звичайному класичному JavaScript-коді (з циклами, умовами тощо)

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 Object-Oriented Programming (OOP) — Об'єкто-Орієнтоване Програмування (ООП)

 ООП в JS — це підхід до організації коду, в якому основним елементом є ОБ’ЄКТИ, що містять ДАНІ (властивості) та МЕТОДИ
 (функції, що оперують даними).


 ОБ'ЄКТИ та КЛАСИ (або функції-конструктори ES6) є основними будівельними блоками ООП


 Key Principles of OOP in JS
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 1. Encapsulation (Інкапсуляція):

    • Приховування деталей реалізації і забезпечення доступу до них через методи.
    • Дані об’єкта не можна змінювати напряму, їх можна змінювати тільки через спеціальні функції (методи), що надають
      доступ до даних.

 2. Inheritance (Наслідування):

    • Це механізм, що дозволяє одному об'єкту успадковувати властивості та методи іншого об'єкта.
    • В JS наслідування реалізується через прототипи або за допомогою класів.

 3. Polymorphism (Поліморфізм):

    • Один і той самий метод або функція може поводитися по-різному для різних об’єктів.
      Інакше кажучи, одне й те саме ім’я методу може мати різну реалізацію залежно від типу об’єкта.

       ◦ Одна назва методу
       ◦ Різна реалізація
       ◦ Реалізація залежить від об'єкта, до якого застосовується цей метод

    • В JS це може бути реалізовано через методи, що мають різну поведінку залежно від типу об’єкта.

 4. Abstraction (Абстракція):

    • Відокремлення суті від деталей реалізації, тобто це принцип приховування внутрішньої реалізації об’єкта та показ
      лише суттєво важливої для користувача інформації  — це вміння сховати все зайве і показати тільки суть.

    • Абстракція — це принцип, за яким ми:

          1. приховуємо складність внутрішньої реалізації об'єкта

          2. відкриваємо лише необхідний інтерфейс — тобто тільки ті методи, які потрібні для використання

     Користувач об'єкта не повинен знати, як він працює, — лише що він може робити

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

                   ООП в JavaScript до ES6 (через функції-конструктори та прототипи)

До того, як ES6 привніс класи, ООП в JavaScript реалізовувалося через функції-конструктори та прототипи.


  1. Encapsulation
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 ПРИНЦИП ІНКАПСУЛЯЦІЇ В JS РЕАЛІЗОВУВАВСЯ ЗА ДОПОМОГОЮ МЕХАНІЗМУ ЗАМИКАНЬ (closure), до появи класів (2015) та
 приватних полів (2019).

 Це дозволяло приховати змінні всередині конструкторів від зовнішнього доступу, тим самим реалізуючи принцип інкапсуляції


 Класи (з 2015 року) надали зручний синтаксис, який замінив конструктори, спрощуючи створення об'єктів і спадкування.
 Але приватність все одно забезпечувалась через замикання — аж до появи #private полів у ES10 (2019).


ПРИКЛАД інкапсуляції через функцію-конструктор: Лічильник

function Counter() { // створюємо функцію констурктор
    let _count = 0;

    this.increment = function () {
        _count++;
        return this;
    };

    this.decrement = function () {
        _count--;
        return this
    }

    this.getCount = function () {
        console.log(_count);
    }
}

const counter = new Counter(); // створюємо новий об'єкт прототипом якого є функція-конструктор Counter
console.log(counter);         // Counter {increment: ƒ, decrement: ƒ, getCount: ƒ}

counter.increment().decrement().increment().getCount(); //1
console.log(counter.count) // undefined - напряму ми не можемо звернутися до count


  ◦ Змінна count — приватна (недоступна ззовні)

  ◦ Всі дії з count відбуваються через публічні методи: increment, decrement, getCount
    Public methods — це методи, які ми можемо викликати напряму через об’єкт

  ◦ Це і є ІНКАПСУЛЯЦІЯ: приховування внутрішнього стану (count) й надання доступу лише через спеціальні методи.

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

ПРИКЛАД інкапсуляції через функцію-конструктор: Створення банківського акаунта

  function BankAccount(owner, balance) {
    let _balance = balance; // приватна змінна через замикання

    this.owner = owner

    // Публічні методи
    this.getBalance = function () {
        return _balance;
    }

    this.deposit = function (amount) {
        if (amount > 0) {
            _balance += amount; // додаємо кошти на рахунок
        }
    }

    this.withdraw = function (amount) {
        if (amount > 0 && amount <= _balance) {
            _balance -= amount;  // знімаємо кошти з рахунку, якщо їх достатньо
        }
    }
  }

  const account = new BankAccount("Anna", 5700); //створення об'єкта account на основі функції-конструктора BankAccount

  console.log(account.owner); //Anna
  console.log(account.getBalance()); //5700

  account.deposit(500);
  console.log(account.getBalance()); //6200

  account._balance = 0; // не змінить справжній баланс
  console.log(account.getBalance()); //6200

❗Бо для кожного об'єкта в функції-конструкторі створюється своя індивідуальна приватна змінна. Ця змінна існує в межах
  замикання (closure), тобто кожен об’єкт має свою копію.

  ◦ Приватна змінна не є властивістю об’єкта, тому вона не зберігається в самому об’єкті і не з’являється у
    console.log(account)

  ◦ Проте методи цього об'єкта посилаються на цю змінну, через це і відбувається замикання

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

Підкреслення на початку _balance - це стилістична домовленість (convention - конвенція) серед програмістів, яка означає:
            ⚠️ "Ця змінна є внутрішньою або приватною, і її не слід чіпати ззовні напряму"


                            Створення функції-конструктора BankAccount

 1. let _balance = balance; — це приватна змінна конструктора BankAccount, приватність якої забезпечує замикання
    Вона недоступна безпосередньо ззовні (не можна написати account._balance), але доступна через методи.

     Якщо б ми використали this.balance = balance замість let _balance = balance, balance став би публічною властивістю
     об'єкта, доступною для змін ззовні. Тобто ми могли б змінювати її безпосередньо, наприклад: account.balance = 200;
     (відсутність інкапсуляції  → відсутність контролю)

 2. this.owner = owner; — створюється публічна властивість owner, яка зберігає ім'я власника рахунку. Вона доступна для
    зовнішнього доступу через об'єкт account.

 3. Методи (усі методи є публічними, бо до них можна звернутися, наприклад account.getBalance):

     ◦ getBalance() — дозволяє отримати поточний баланс
     ◦ deposit(amount) — дозволяє додавати гроші на рахунок, якщо сума депозиту більша за нуль
     ◦ withdraw(amount) — дозволяє зняти гроші з рахунку, якщо сума зняття менша або рівна поточному балансу



  2. Inheritance
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 Це механізм, що дозволяє одному об'єкту успадковувати властивості та методи іншого об'єкта, через ланцюжок прототипів.
 В JS НАСЛІДУВАННЯ РЕАЛІЗУЄТЬСЯ ЧЕРЕЗ ПРОТОТИПИ АБО ЗА ДОПОМОГОЮ КЛАСІВ.

 Inheritance дозволяє створювати нові об’єкти (або класи) на основі вже існуючих.

ПРИКЛАД:

 function Animal(name) {
    this.name = name;     // Зазвичай властивості унікальні для кожного об'єкта,
 }                       // тому їх записують в функції конструктори через this

 Animal.prototype.walk = function () {
     console.log(`${this.name} walks`)   // Методи навпаки часто однакові для всіх об'єктів одного типу,
 }                                      // тому їх зберігають у прототипі, щоб не дублювати в кожному екземплярі

 Animal.prototype.sleep = function () {
     console.log(`${this.name} sleeps`)
 }

 function Cat(name) {
     Animal.call(this, name)   // Передаємо аргумент name від Cat до Animal
 }

‾‾‾‾‾‾‾‾
Animal.call(this, name)
  • дозволяє викликати конструктор Animal в контексті поточного об'єкта (який є екземпляром Cat)
  • та передати значення аргументу name з конструктора Cat до конструктора Animal,
  • але не налаштовує прототипне наслідування між Cat та Animal
‾‾‾‾‾‾‾‾‾

 Cat.prototype = Object.create(Animal.prototype);  // налаштовуємо прототипне наслідування, щоб екземпляри Cat могли
                                                  // використовувати методи з Animal.prototype

 Cat.prototype.constructor = Cat; // відновлюємо правильний конструктор для Cat, щоб він вказував на Cat, а не на Animal

 Cat.prototype.meow = function () {
     console.log(`${this.name} meows`)
 }

 function Dog(name) {
     Animal.call(this, name)
 }

 Dog.prototype = Object.create(Animal.prototype);
 Dog.prototype.constructor = Dog;

 Dog.prototype.bark = function () {
     console.log(`${this.name} barks`)
 }

 const cat1 = new Cat('Cat')
 cat1.walk()  //Cat walks

 const dog1 = new Dog('Dog')
 dog1.sleep()  //Dog sleeps

‾‾‾‾‾‾‾‾‾
  ◦ Object.create(Animal.prototype) - створює новий об’єкт, який має Animal.prototype як свій прототип
  ◦ Cat.prototype =  - призначає цей новий об’єкт як Сat.prototype.

 Тобто об'єкт який буде створений через функцію-конструктор Cat (наприклад cat1) буде мати прототипний ланцюжок:

   cat1  →   Cat.prototype  →  Animal.prototype  →  Object.prototype  →  null


❗Cat.prototype = Animal.prototype —  ЦЕ НЕ НАСЛІДУВАННЯ, ЦЕ СПІЛЬНИЙ ПРОТОТИП, ЯКИЙ ЛАМАЄ НЕЗАЛЕЖНІСТЬ ІЄРАРХІЇ❗

 Бо обидві функції будуть посилатися на один і той самий прототип, і зміни в Cat.prototype вплинуть на
 Animal.prototype.

 Цей рядок каже: Cat.prototype і Animal.prototype — це один і той самий об’єкт у памʼяті

 НАСЛІДКИ:
  Якщо ти змінюєш Cat.prototype, ти автоматично змінюєш Animal.prototype — і навпаки



  3. Polymorphism (Поліморфізм)
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 Один і той самий метод або функція можуть поводитися по-різному для різних об’єктів.
 Інакше кажучи, одне й те саме ім’я методу може мати різну реалізацію залежно від типу об’єкта.

    ◦ Одна назва методу
    ◦ Різна реалізація
    ◦ Реалізація залежить від об'єкта, до якого застосовується цей метод

 В JS це може бути реалізовано через методи, що мають різну поведінку залежно від типу об’єкта.


ПРИКЛАД:

 function Animal(name, sound) {
     this.name = name;
     this.sound = sound;
 }

 Animal.prototype.speak = function() {
     console.log(`${this.name} speaks: ${this.sound}`);
 };

 function Cat(name) {
     Animal.call(this, name, "meow");  // Передає властивість name та sound від Cat до Animal
 }

 Cat.prototype = Object.create(Animal.prototype);  // Успадковує метод speak від Animal
 Cat.prototype.constructor = Cat;                 // Відновлює правильний конструктор

 function Dog(name) {
     Animal.call(this, name, "bark");
 }

 Dog.prototype = Object.create(Animal.prototype);
 Dog.prototype.constructor = Dog;


 // Створюємо екземпляри
 const cat1 = new Cat("Kitty");
 cat1.speak();                  // Kitty speaks: meow

 const dog1 = new Dog("Daisy");
 dog1.speak();                 // Daisy speaks: bark

‾‾‾‾‾‾‾‾‾

 ЧОМУ ЦЕЙ ПРИКЛАД Є КЛАСИЧНИМ ПОЛІМОРФІЗМОМ:

  1. Загальний метод speak() в базовому класі Animal

     ◦ Це єдине місце, де визначається поведінка для всіх об'єктів (кожного типу тварини). Тобто базовий клас визначає,
       що всі тварини можуть говорити.

     ◦ А вже конкретні тварини (як коти чи собаки) реалізують свою специфічну поведінку через звук, який вони видають

  2. Поведінка цього методу залежить від типу об'єкта

     ◦ Метод speak() поводиться по-різному, залежно від того, на якому об'єкті він викликається

     ◦ Для Cat - це "meow", для Dog - "bark". Це залежить від того, яке значення властивості sound було передане у
       конструкторі

  3. Метод не знає наперед, на якому об'єкті він буде викликаний:

     ◦ Метод speak() є універсальним в тому сенсі, що він працює для будь-яких об'єктів, які успадкували його від Animal

     ◦ Він визначає свою поведінку за допомогою значень, переданих об'єктам при їх створенні
       (наприклад, "meow" для кота та "bark" для собаки)

 ТАКИМ ЧИНОМ, ЦЕ КЛАСИЧНИЙ ПОЛІМОРФІЗМ:

     ◦ Один метод (speak), який поводиться по-різному для різних типів об'єктів

     ◦ Це досягається через наслідування чи перевизначення методів в підкласах



  4. Abstraction (Абстракція)
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 • Відокремлення суті від деталей реалізації, тобто це принцип приховування внутрішньої реалізації об’єкта та показ
   лише суттєво важливої для користувача інформації. Це вміння сховати все зайве і показати тільки суть

 • Абстракція — це принцип, за яким ми:

       ◦ приховуємо складні внутрішні деталі реалізації об'єкта

       ◦ і надаємо користувачу простий, зрозумілий інтерфейс для роботи з об'єктом (тобто відкриваємо лише необхідний
         інтерфейс — тільки ті методи, які потрібні користувачу)

 Користувач об'єкта не повинен знати, як він працює — лише що він може робити


ПРИКЛАД: Абстрагований банківський рахунок

 function createAccount(initialBalance) { // ЦЕ НЕ ФУНКЦІЯ-КОНСТРУКТОР

     let _balance = initialBalance; // створення локальної змінної, яка недоступна ззовні
                                   // усі методи (deposit, withdraw, checkBalance) мають до неї доступ завдяки замиканню

     return {                 // Повертаємо об’єкт, який містить три методи. Ці методи мають доступ до змінної balance,
         deposit(amount) {   // бо всі вони створені в одному лексичному оточенні (завдяки замиканню)
             if (amount > 0) {
                 _balance += amount;
                 console.log(`Поповнено на ${amount}`);
                 this.checkBalance()
             }
         },

         withdraw(amount) {
             if (amount > 0 && amount <= _balance) {
                 _balance -= amount;
                 console.log(`Знято ${amount}`);
                 this.checkBalance()

             } else {
                 console.log(`Недостатньо коштів`);
                 this.checkBalance()
             }
         },

         checkBalance() {
             console.log(`Поточний баланс: ${_balance}`);
             console.log("");
         }
     };
 }

 const myAccount = createAccount(500); // створення рахунку  (не через функцію-конструктор)
 // Ми просто викликаємо функцію яка повертає нам об'єкт, який ми зберігаємо в змінну myAccount

 //console.log(myAccount); //{deposit: ƒ, withdraw: ƒ, checkBalance: ƒ}

 myAccount.checkBalance();      // Поточний баланс: 500
 myAccount.deposit(200);        // Поповнено на 200    Поточний баланс: 700
 myAccount.withdraw(100);       // Знято 100    Поточний баланс: 600

console.log(myAccount._balance); // undefined доступу немає

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 СТВОРЕННЯ РАХУНКУ:
   ◦ Ми викликаємо функцію createAccount з початковим балансом 500

   ◦ Повернутий об’єкт зберігається в myAccount (він має три методи)

   ◦ balance = 500 — але доступу до нього напряму немає, лише через методи.

        Це тому, що balance — це локальна змінна функції createAccount, і вона не є частиною повернутого об’єкта.
        Вона існує лише внутрішньо, у замиканні. Методам вона доступна, а зовнішньому коду — ні.


❗Це і є сутність абстракції: Ми даємо користувачу інтерфейс (методи),
                                                          і приховуємо реалізацію (змінну balance і логіку перевірки) ❗

 ПРИХОВАНЕ:

   1. Змінна balance:
         • недоступна напряму
         • не видно як саме вона зберігається чи змінюється
         • користувач не може зіпсувати дані, випадково щось переписавши

   2. Внутрішня логіка:
         • Перевірка на те, чи сума більша за 0
         • Перевірка, чи є достатньо коштів для зняття
         • форматування виведення повідомлення в console.log за допомогою шаблонних рядків

  Це все деталі реалізації, які приховані від користувача


 ДОСТУПНЕ:  Користувач має доступ лише до методів:
                                                   • deposit(amount)
                                                   • withdraw(amount)
                                                   • checkBalance()

 Це і є інтерфейс користувача — чітко обмежений набір можливих дій

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾


                    ПРОТОТИП У ФУНКЦІЙ (prototype) та ПРОТОТИП У ОБ'ЄКТІВ ([[Prototype]])

 1. ПРОТОТИП У ФУНКЦІЙ  —  prototype  —   використовується у функціях-конструкторах
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

   ◦ кожна функція має стандартну властивість prototype

       Вона використовується для того, щоб додавати методи чи властивості до прототипу (prototype) об'єкта, який буде
       створений за допомогою цього конструктора

       Тобто prototype — це об'єкт, який стає прототипом для всіх об'єктів, створених через функцію-конструктор


   ◦ prototype — це об'єкт, який за замовчуванням порожній {}

   ◦ всі об'єкти, які створюються за допомогою цієї функції-конструктора, мають доступ до властивостей та методів, що
     зберігаються в prototype

       Отже:
        ◦ prototype — це об'єкт, який зберігається як властивість функції-конструктора
        ◦ цей об'єкт не є прототипом функції, а є прототипом об'єктів, які створюються через цю функцію


❗ В усіх функціях, створених через function, є властивість prototype, але практично він використовується лише при     ❗
   створенні об'єктів через new з використанням функцій-конструкторів (або класів)


ПРИКЛАД:

 function User(name) {
     this.name = name;
 }

 // на момент створення функції-конструктора User, її властивість prototype є порожнім об'єктом
 console.log(User.prototype); //{}

 User.prototype.greet = function () {
      console.log(`Hello! Nice to meet you, ${this.name}!`);
 }

 // Тепер всі об'єкти, створені через User, мають доступ до цього методу через свій прототип

 const user1 = new User("Anna");
 const  user2 = new User("Kate");
 user1.greet(); // Hello! Nice to meet you, Anna!
 user2.greet(); // Hello! Nice to meet you, Kate!

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 ◦ Властивості і методи, які ми створюємо всередині функції-конструктора через this окремо створюються в кожному новому
   об'єкті, створеному через new. Тобто кожен об'єкт має свою власну копію name.

    function User(name) {
      this.name = name;  // у кожного екземпляра буде своя властивість name
    }

    const user1 = new User("Anna")

         • User — це функція-конструктор
         • User.prototype — це об'єкт-прототип для всіх об’єктів, створених через new User(name).
         • user1 — це екземпляр об’єкта, побудований на базі User.prototype.


 ◦ Метод, який ми додаємо через .prototype не дублюється в кожному екземплярі.

   Замість цього, кожен екземпляр посилається на спільний метод у User.prototype.


ВИСНОВОК:

  ◦ Те, що в функції-конструкторі через this, потрапляє в сам об'єкт.
  ◦ Те, що в Function.prototype, залишається в прототипі, і до нього посилаються всі об'єкти, створені через new



 2. ПРОТОТИП У ОБ'ЄКТІВ [[Prototype]]
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

  ◦ Кожен об'єкт в JS має внутрішнє поле (механізм, що відповідає за прототипне наслідування) — [[Prototype]],
   яке доступне через:

         • Object.getPrototypeOf(obj))
         • __proto__  (властивість об'єкта, яка вказує на його прототип)       ⚠️ вважається застарілою

   ◦ Це внутрішнє поле вказує на інший об'єкт (ПРОТОТИП), з якого цей об'єкт успадковує властивості та методи

   ❗Тобто [[Prototype]] — це посилання на інший об'єкт, який є прототипом поточного об'єкта ❗


ПРИКЛАД УСПАДКУВАННЯ ЧЕРЕЗ ПРОТОТИП:

  const animal = { // створюємо об'єкт animal, у якого є метод speak
      speak() {
          console.log("Animal speaks");
      }
  }

  const cat = Object.create(animal); //Створюємо об'єкт cat з animal як прототипом

‾‾‾‾‾‾‾‾‾‾‾

 Метод Object.create(animal) створює новий об'єкт cat і встановлює [[Prototype]] цього нового об'єкта як
 посилання на animal

 ТОМУ: Object.getPrototypeOf(cat) === animal  // true

 Й коли ми пишемо console.log(Object.getPrototypeOf(cat)), в консолі ми отримуємо:   {
                                                                                      speak: ƒ speak()
                                                                                      [[Prototype]]: Object
 ЦЕ ОЗНАЧАЄ:                                                                         }
    ◦ Прототип cat — це об’єкт, у якого є метод speak
    ◦ А прототип цього об'єкта (тобто animal) — це вже звичайний Object.prototype


                                                  Object.prototype
                                                ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
 Object.prototype — це основний (найвищий) прототип у JS, з якого успадковують усі об’єкти, якщо в їхньому ланцюжку
 прототипів немає іншого явно заданого прототипу.

 Тобто Object.prototype — це об'єкт, який:

    ◦ є найвищою точкою в ланцюжку прототипів у JavaScript

    ◦ містить загальні методи й властивості, які доступні всім звичайним об’єктам

    ◦ успадковується автоматично, якщо ми не вказуємо інший прототип

    ◦ коли ми звертаємось до властивості об'єкта, але її там немає, JS шукає її в прототипі



 ЩО ЗБЕРІГАЄТЬСЯ В Object.prototype?   console.log(Object.getOwnPropertyNames(Object.prototype));

  ◦ Object.prototype — це базовий об’єкт, від якого усі об’єкти в JS наслідують
  ◦ Object.getOwnPropertyNames() — метод, який повертає усі властивості переданого об’єкта у вигляді масиву рядків

      [
       0: "constructor",             ‾‾| особлива ВЛАСТИВІСТЬ: посилання на функцію-конструктор, яка створила цей об'єкт
       1: "hasOwnProperty",          ‾‾|
       2: "isPrototypeOf",             |
       3: "propertyIsEnumerable",      |  МЕТОДИ
       4: "toLocaleString",            |
       5: "toString",                  |
       6: "valueOf",                 __|
       7: "__defineGetter__",          |
       8: "__defineSetter__",          |
       9: "__lookupGetter__",          |  АКСЕСОРИ (гетери/сетери)
       10: "__lookupSetter__",       __|
       11: "__proto__"               __| ВЛАСТИВІСТЬ
       length: 12
       [[Prototype]]: Array(0)      Прототипом масиву є Array.prototype
      ]

       Ці методи доступні всім звичайним об'єктам, якщо ти їх не перезапишеш

‾‾‾‾‾‾‾‾‾‾‾‾
 Array.prototype — це об’єкт, який:
    ◦ Містить усі стандартні методи масивів: push, pop, map, filter, forEach, тощо.
    ◦ Є спільним прототипом для всіх масивів, створених у JS.

 Коли ми викликаємо якийсь метод масивів, наприклад arr.filter, JS не знаходить метод filter безпосередньо в об’єкті arr
 тому переходить по прототипному ланцюгу до Array.prototype, і знаходить метод filter там.

‾‾‾‾‾‾‾‾‾‾‾‾

 Усі звичайні об'єкти мають у собі приховане поле [[Prototype]], яке вказує на Object.prototype

     const obj = {};
     console.log(Object.prototype === Object.getPrototypeOf(obj)); //true - вони посилаються на один й той же об'єкт


 ПРОТОТИПНИЙ ЛАНЦЮЖОК для obj (звичайного об’єкта, створеного літералом) виглядає так:

     obj  →  Object.prototype  →  null

❗Object.prototype — це вершина прототипного ланцюжка. Його [[Prototype]] (або __proto__) дорівнює null ❗
  Це означає, що пошук припиняється — далі ланцюжка немає (тобто null - це кінець будь-якого прототипного ланцюжка)


 Прототипний ланцюжок (prototype chain) — це механізм, за допомогою якого відбувається успадкування властивостей і
 методів між об’єктами.

 Якщо ми створюємо функцію-конструктор:

   function User(name) {
       this.name = name;
   }

   const user1 = new User("Anna");

   console.log(Object.getPrototypeOf(user1)); // ми отримаємо об'єкт, у якого є властивість constructor: f User(name)

   console.log(Object.getPrototypeOf(user1) === User.prototype); //true
   console.log(Object.getPrototypeOf(User.prototype) === Object.prototype); //true


 user1 → User.prototype → Object.prototype → null

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 РІЗНИЦЯ між prototype і [[Prototype]]:

 1. prototype:

   ◦ Це властивість функції-конструктора

   ◦ Визначає методи та властивості, які будуть доступні всім об'єктам, створеним цією функцією-конструктором

   ◦ Прив'язано до функції-конструктора

 2. [[Prototype]]:

   ◦ Це внутрішнє поле, яке має можен об'єкт (ми не можемо звертатися до [[Prototype]] напряму)

   ◦ Воно вказує на прототип цього об'єкта

   ◦ За допомогою [[Prototype]] JS встановлює зв'язок між об'єктами, що дозволяє перевіряти, на який прототип вказує
     об'єкт

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 СПІЛЬНЕ МІЖ [[Prototype]] та prototype

❗Коли ми створюємо об'єкт через функції-конструктор, то [[Prototype]] цього об'єкта вказує на prototype конструктора ❗

 function User(name) {
     this.name = name;
 }

 User.prototype.greet = function () {
    console.log(`Hello ${this.name}`)
 }

 const user1 = new User("Anna");

 console.log(Object.getPrototypeOf(user1) === User.prototype); //true

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 ООП — це парадигма в програмуванні, яка існує вже дуже давно. Деякі мови, як-от Java або C#, були створені спеціально
 для ООП і вимагають від програміста писати саме в цьому стилі.

 Однак, JS — це мультипарадигмова мова. В ній можна писати як в ООП стилі (через функції-конструктори, прототипи або
 класи з ES6), так і в функціональному або імперативному стилях

 Тож ООП в JS — це не обов’язковий підхід, а лише один зі стилів, який можна використовувати.

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾                                                             ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 Один з міфів про ООП це те що для нього обов’язково потрібні класи. Але це не так. У JS не було класів до стандарту ES6
 (2015 року), однак мова вже тоді підтримувала об'єктно-орієнтоване програмування.

 JavaScript реалізує ООП через прототипи, функції-конструктори та об’єкти. Це означає, що розробники могли створювати
 об’єкти, наслідування, інкапсуляцію й навіть поліморфізм без використання класів.

 Класи в JS — це синтаксичний цукор, тобто зручніший запис для роботи з прототипами, який робить код зрозумілішим і
 ближчим до класичного ООП у таких мовах, як Java чи C++.

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 У JS ВСІ ФУНКЦІЇ — ЦЕ ОБ'ЄКТИ, СТВОРЕНІ ЗА ДОПОМОГОЮ КОНСТРУКТОРА Function.

 Тобто навіть функції-конструктори які ми створюємо, наприклад:   function MyConstructor() {}

 насправді є екземплярами Function:

 console.log(MyConstructor instanceof Function); // true — перевіряємо, чи MyConstructor є об'єктом, створеним за
                                                           допомогою конструктора Function

instanceof — це оператор в JS, який перевіряє, чи є певний об'єкт екземпляром вказаного конструктора, або чи він
успадковує прототип цього конструктора.


ТОМУ будь-яка функція має:

                         ◦ console.log(MyConstructor.__proto__ === Function.prototype);    // TRUE

                         ◦ console.log(Function.prototype.__proto__ === Object.prototype); // TRUE

                         ◦ console.log(Object.prototype.__proto__ === null);               // TRUE  —   кінець ланцюга


 __proto__ — це внутрішнє (але доступне) посилання на прототип, яке є у кожного об'єкта, а все в JS є об'єктом, в тому
 числі і функції

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

ПРИКЛАД:

function Car(mark) {
    this.wheels = 4;
    this.mark = mark;
}

Car.prototype.drive = function () {
   console.log(`${this.mark}: Let's go!`)
}

const bmw = new Car("BMW");
const audi = new Car("Audi");

bmw.drive();
audi.drive();

console.log(Object.getPrototypeOf(bmw) === Car.prototype); //true

console.log(bmw.drive === audi.drive); //true  —  Бо bmw і audi використовують один і той самий метод drive, що лежить у
//                                                Car.prototype, тож це - посилання на одну й ту саму функцію в пам’яті


‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

                               ВСЕ В JS — ЦЕ ОБ'ЄКТИ… АЛЕ НЕ ЗОВСІМ

 У JavaScript є два основних типи даних:

     ОБ'ЄКТИ:                   ПРИМІТИВИ (не об'єкти)         Більшость ПРИМІТИВІВ мають відповідні об'єктні обгортки:
    ‾‾‾‾‾‾‾‾‾‾                 ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
     1. object                     1. string                              String  →  string
     2. array                      2. number                              Number  →  number
     3. function                   3. boolean                             Boolean →  boolean
     4. дати                       4. bigint                              BigInt  →  bigint
     5. регулярні вирази           5. symbol                              Symbol  →  symbol
                                   6. undefined
                                   7. null                              (окрім undefined і null)

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
                             ❗ОБ'ЄКТНІ ОБГОРТКИ  —  ЦЕ ФУНКЦІЇ-КОНСТРУКТОРИ ❗
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

❗ЦІ ОБ'ЄКТНІ ОБГОРТКИ ДОЗВОЛЯЮТЬ ПРИМІТИВАМ ПОВОДИТИСЯ ЯК ОБ'ЄКТИ, НАДАЮЧИ ДОСТУП ДО МЕТОДІВ І ВЛАСТИВОСТЕЙ ❗

  Бо коли ми викликаємо метод на примітивному значенні, JavaScript виконує наступні кроки:

        1. Створює тимчасовий об'єкт-обгортку відповідного типу

        2. Виконує метод або надає доступ до властивості на цьому об'єкті

        3. Видаляє тимчасовий об'єкт після завершення операції


  ПРИКЛАД
‾‾‾‾‾‾‾‾‾‾‾
     const str = "hello";  // це рядок-примітив, не об'єкт. Але ми все одно можемо викликати метод .toUpperCase()
     console.log(str.toUpperCase()); // HELLO

 Бо коли ми викликаємо метод на примітиві, JavaScript:

     1. тимчасово створює об'єкт-обгортку  —  new String("hello"))
     2. використовує метод з прототипу String.prototype (String - це функція-конструктор,:),
     3. а потім знищує цей об'єкт


 JS ПІД КАПОТОМ:
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
 1. str = new String(str).toUpperCase()

     ◦ new String(str) — це створення нового об'єкта, який є екземпляром функції-конструктора String
       В результаті ми отримуємо об'єкт (назвемо його obj), що містить збережений рядок — console.log(obj)  →  {'hello'}

     ◦ Цей об'єкт має доступ до методів, які визначені в прототипі конструктора String
       Тобто всіх методів які "має рядок": slice(), indexOf(), split() etc.

 2. str = obj.toUpperCase();

     ◦ toUpperCase - це метод з String.prototype
     ◦ JS шукає цей метод в об'єкті obj й, не знайшовши, йде по ланцюжку прототипів:

       obj  →  String.prototype  →  Object.prototype  →  null
              ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
     ◦ Метод toUpperCase читає рядкові дані ("hello") всередині об'єкта obj і повертає новий примітивний рядок "HELLO"
       ТОБТО str = "HELLO"

 3. obj знищується після виклику методу

     ◦  У JS, якщо об'єкт не збережений у змінну або на нього більше немає посилань, він стає доступним для
        сміттєзбиральника (garbage collector).

     ◦  У нашому прикладі, після того як метод toUpperCase() викликається на об'єкті obj, він повертає новий примітивний
        рядок, який зберігається у змінну str. Змінна str більше не містить посилання на сам об'єкт — лише на результат
        методу.

     ◦ Таким чином, об'єкт obj буде очищений, оскільки більше немає активних посилань на нього після виконання методу.


‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

                                               ГЕТЕРИ і СЕТЕРИ

 Це спеціальні методи в об'єктах, за допомогою який можна зробити інкапсуляцію

 Гетери (get) і сетери (set) — це спеціальні МЕТОДИ ОБ'ЄКТА в JS які використовуються в ООП, та дозволяють
 ОТРИМУВАТИ (get) та ЗМІНЮВАТИ (set) значення приватних або захищених властивостей об'єкта.

   ◦ Гетер повертає значення приватної властивості об’єкта

   ◦ Сетер встановлює значення цій властивості, але з перевірками (set без перевірки не має особливої користі)

 ЇХ МЕТА: контролювати доступ до змінної, не даючи прямого доступу до неї


 ОСНОВНІ ЦІЛІ ГЕТЕРІВ І СЕТЕРІВ:

  1. Інкапсуляція — приховування внутрішніх змінних

     Користувач працює з публічною властивістю (наприклад, name), але фактично взаємодіє лише через гетер та сетер, які
     можуть додавати перевірки або виконувати додаткову логіку. Прямої взаємодії з _name не відбувається.

     const person = {
       _name: 'Anna',

       get name() {         // Гетер для отримання імені
         return this._name;
       },

       set name(newName) {  // Сетер для встановлення імені
         if (newName.length > 1) {
           this._name = newName;
         } else {
           console.log('The name is too short');
         }
       }
     };

     person.name = 'Kate';      // змінюємо name
     console.log(person.name); // Kate

     person.name = 'T';         // The name is too short


  2. SETTER: Валідація
     Використовуючи сетер, ми можемо додавати перевірку правильності даних перед тим, як вони будуть записані в об'єкт.

     const employee = {
         _salary: 0,

         get salary() {
             return this._salary;
         },

         set salary(value) {
           if (typeof value !== "number" || value <= 0) {
               console.log("Salary is invalid")
               return;
           }
          this._salary = value;
         }
     }

     employee.salary = 1000;       // встановлюємо через сетер
     console.log(employee.salary); // 1000 — отримуємо через гетер

     employee.salary = "aaa";     // Salary is invalid


  3. GETTER: Обчислення (динамічні властивості)

     Гетери можуть повертати обчислені значення. Це дозволяє створювати динамічні властивості, які змінюються залежно
     від інших полів об'єкта.


     const bankAccount = {
         _balance: 2000, // уся сума на рахунку
         frozen: 500,   // заморожені кошти

         get available() {
             return this._balance - this.frozen; // гетер обчислює і повертає доступну для використання суму
         }
     }

     console.log(bankAccount.available); // 1500


  4. Абстракція (покращення інтерфейсу)
     Гетери та сетери допомагають створити більш інтуїтивно зрозумілий інтерфейс для об'єкта, замаскувавши складні
     операції


     const user = {
         _firstName: "Kate",
         _lastName: "Doe",

         get firstName() {        // просто повертає ім’я
            return this._firstName;
         },
         get lastName() {        // просто повертає прізвище
             return this._lastName
         },

         get fullName() {       // повертає повне ім’я
             return `${this._firstName} ${this._lastName}`;
         },

         set fullName(fullName) {
             const [firstName, lastName] = fullName.split(" ");
             if (firstName.length > 1 && lastName.length > 1) {
                 this._firstName = firstName;
                 this._lastName = lastName;
             } else {
                 console.log("Invalid name");
             }
         }
     }

     console.log(user.firstName);  // Kate
     user.fullName = "Anna Smith";
     console.log(user.fullName);  // Anna Smith

 Гетери та сетери створюють ілюзію звичайного звернення до властивості, хоча насправді за лаштунками викликається
 функція. Це дозволяє непомітно додавати додаткову логіку — наприклад, валідацію даних.

 ГЕТЕРИ ТА СЕТЕРИ ОСОБЛИВО АКТИВНО ВИКОРИСТОВУЮТЬСЯ В КЛАСАХ під час створення складних об’єктів, оскільки дозволяють
 приховувати внутрішні поля, додавати логіку валідації чи обчислення, та водночас зберігати зручний і зрозумілий
 синтаксис доступу до властивостей.


‾‾‾‾‾‾‾‾‾‾‾‾‾‾                                                                                            ‾‾‾‾‾‾‾‾‾‾‾‾‾‾
          Підкреслення на початку (_firstName) - це стилістична конвенція серед програмістів, яка означає:
                ⚠️ "Ця змінна є внутрішньою або приватною, і її не слід чіпати ззовні напряму"

❗ОДНАК це лише умовна домовленість, яка не гарантує справжньої приватності, адже ми все одно можемо безперешкодно ❗
  звернутися до поля напряму, наприклад user._firstName = "Emma", і змінити його в обхід гетерів та сетерів.

 Для повноцінного захисту даних у JS передбачено приватні поля (2019), які оголошуються за допомогою символу #,
 наприклад #firstName. Такі поля справді недоступні ззовні: спроба звернутися до них напряму призведе до помилки.

‾‾‾‾‾‾‾‾‾‾‾‾‾‾                                                                                            ‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 СТВОРЕННЯ ГЕТЕРІВ І СЕТЕРІВ ЧЕРЕЗ ФУНКЦІЮ-КОНСТРУКТОР

 В функціях-конструкторах ми не можемо безпосередньо використовувати get і set — це призведе до синтаксичної помилки.

 Але є спосіб реалізувати цю функціональність за допомогою додаткового методу об'єктів — Object.defineProperty().
 Він дозволіє додавати додатдодаткові налаштовування до властивості об’єкта.

 За допомогою цього методу можна створити нову властивость об’єкта й додати до неї багато налаштувань.

 Тобто визначати, чи можна змінювати значення властивості, чи буде ця властивість доступна при переборі об’єкта
 через:  for...in,  Object.keys(),  Object.values(),  Object.entries()) та чи можна її видаляти або змінювати опис.
        ‾‾‾‾‾‾‾‾‾‾ ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾ ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾ ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾


 const user = {}

 Object.defineProperty(user, "name", { // третім параметром передаємо об'єкт з налаштуваннями

     value: "Anna",       // встановлюємо значення

     writable: false,     // вказує, чи можна змінювати значення цієї властивості (false - не можна)

     enumerable: false,   // визначає, чи буде властивість доступною при переборі об'єкта (false - не буде)

     configurable: false  // визначає чи можна видалити властивість з об'єкта за допомогою delete
                          // та чи можна змінити її опис (наприклад, зробити writable: true → false)  (false - не можна)
 })

 user.name = "Kate"  // не спрацює, бо writable: false
 console.log(user.name) // Anna

 delete user.name;  // не спрацює, бо configurable: false
 console.log(user.name); // Anna

 Object.defineProperty(user, "name", { // зміна налаштувань викличе помилку, бо configurable: false
     writable: true
 })



 Метод defineProperty() хоч і потужний, але не дуже популяний в звичайній практиці.

 ОСКІЛЬКИ:
           ◦ має складний синтаксис
           ◦ У більшості реальних задач не потрібно настільки гнучко керувати властивостями
           ◦ сучасний JavaScript має класи з вбудованою підтримкою get/set, які зручніші

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

function User(name) {
    let _name = name;

    Object.defineProperty(this, "name", {
        get() {
            return _name;
        },
        set(newName) {
            if (/^[A-ZА-ЯІЇЄҐ][a-zA-Zа-яіїєґА-ЯІЇЄҐ]+$/) { //починається з великої літери, має щонайменше 2 літери
                _name = newName;
            } else {
                console.log("The name is not correct");
            }
        }
    })
}

const user1 = new User("Emma");
console.log(user1.name);  // Emma

user1.name = "K";  // The name is too short
user1.name = "Kate";
console.log(user1.name);  // Kate

console.log(user1) //  User {
                   //         name: "Kate"
                   //         get name: ƒ get()
                   //         set name: ƒ set(newName)
                   //  }


‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 TASK: Створення персонажів гри

 function Character(name, damage)  {

     // Оголошуємо приватні змінні
     let _health = 100;    // початкове здоров'я
     let _level = 1;       // початковий рівень
     let _damage = damage  // початковий рівень атаки

     // Ці змінні недоступні напряму ззовні, бо це локальні змінні функції, а не властивості об'єкта.
     // Це зроблено для того щоб гравець не зміг вручну змінити значення цих змінних (наприклад: Aragorn.level = 5)

     this.weapon = "bare hands"; // універсальна зброя за замовчуванням

     Object.defineProperty(this, "name", {  //Додаємо публічну властивість name й встановлюємо її як read-only
         value: name,
         writable: false,    // це значення можна було не писати, бо по дефолту вони всі false
         enumerable: true,
         configurable: false // це теж можна було не писати
     })

     // СТВОРЮЄМО ГЕТЕРИ ТА СЕТЕРИ ДЛЯ КОЖНОЇ З ПРИВАТНИХ ЗМІННИХ

     Object.defineProperty(this, "health", {
        get() {
            return _health;
        }, // Гетери дозволяють читати значення прихованих змінних через публічні властивості (health, level, damage)

        set(newHealth) {
            console.warn("You can't change the health level right here!")
        } // Сетери просто виводять повідомлення про помилку, і не змінюють внутрішній стан прихованих змінних

         // БО гравець має бачити "стан" персонажа, але не має права просто так змінити його на свою користь
     })

     Object.defineProperty(this, "level", {
        get() {
             return _level;
        },
        set(newLevel) {
             console.warn("You can't change the level right here!")
        }
     })

     Object.defineProperty(this, "damage", {
         get() {
             return _damage;
         },
         set(newDamage) {
             console.warn("You can't change the damage right here!")
         }
     })

  // ВНУТРІШНІ МЕТОДИ: Чому ми створюємо їх всередині конструктора, а не додаємо в прототип?

  // Бо наші приватні змінні - це локальні змінні функції-конструктора (ВОНИ НЕ Є ВЛАСТИВОСТЯМИ ОБ'ЄКТА) й тому до них
  // можна дістатися лише зсередини цього конструктора.

     this._changeHealth = function (newHealth) { //оновлює значення health в межах від  максимального (100) до 0
         _health = Math.max(0, newHealth);
     }

     this._levelUp = function() {               // підвищує рівень персонажа і збільшує його damage на 5
         _level++;
         _damage += 5;
     }
 }

 Character.prototype.status = function() {     // Показує стан персонажа: ім’я, здоров’я та рівень
     console.log(`${this.name} [HP: ${this.health}], LVL:${this.level}`);
     console.log("");
 };

 Character.prototype.isAlive = function (message) {
     if (this.health <= 0) {
         console.log(`${this.name} ${message}`)
         console.log("");
         return false;
     }
     return true
 }


  Character.prototype.attack = function (target) {
     if (target.isAlive("is already dead. No need to attack.")) return;


     target._changeHealth(target.health - this.damage);  // Зменшує health супротивника

     console.log(`${this.name} attacks ${target.name} with ${this.weapon}!   ${target.name} [${target.health} HP]`)
     console.log("");                  // Виводить повідомлення про атаку

      if (!target.isAlive("has fallen!")) return;


      if (target.health < 60) {       // Якщо health цілі впав нижче 60 → автоматично викликає levelUp(),
          this._levelUp();            // який підвищує рівень і додає +5 до урону
          console.log (`LVL UP! ${this.name} LVL:${this.level} (+5 damage)`)
          console.log("");
      }
 }

 // ◦ Методи, визначені в конструкторі, працюють лише з приватними змінними цього конкретного екземпляра
 //  (оскільки кожен екземпляр має свої власні копії як методів, так і приватних змінних)
 //
 // ◦ Методи в прототипі працюють з публічними властивостями об'єкта та доступні всім екземплярам конструктора


 function Warrior(name) {
     Character.call(this, name, 10);
     this.weapon = "a sword"
 }

 Warrior.prototype = Object.create(Character.prototype);  // Warrior.prototype.__proto__ = Character.prototype;
 Warrior.prototype.constructor = Warrior;

  function Mage(name) {
     Character.call(this, name, 15);
     this.weapon = "a fireball";
 }

 Mage.prototype = Object.create(Character.prototype);
 Mage.prototype.constructor = Mage;


 const Aragorn = new Warrior("Aragorn");
 const Saruman = new Mage("Saruman");

 Aragorn.status();            // Aragorn [HP: 100], LVL:1
 Saruman.status();            // Saruman [HP: 100], LVL:1

 Saruman.attack(Aragorn);     // Saruman attacks Aragorn with a fireball!   Aragorn [85 HP]
 Aragorn.attack(Saruman);     // Aragorn attacks Saruman with a sword!   Saruman [90 HP]

 Aragorn.damage = 30;         // You can't change the damage right here!
 console.log(Aragorn.damage); // 10

 Saruman.attack(Aragorn)      // Saruman attacks Aragorn with a fireball!   Aragorn [70 HP]
 Saruman.attack(Aragorn)      // Saruman attacks Aragorn with a fireball!   Aragorn [55 HP]
                              // LVL UP! Saruman LVL:2 (+5 damage)
 console.log(Saruman.damage); // 20

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

  HW16.1

 function Student (name, yearOfBirth) {

     this.name = name;
     this.yearOfBirth = yearOfBirth;

     Object.defineProperty(this, "age", {
        get: function () {
            return new Date().getFullYear() - this.yearOfBirth;
        },
        set: function (newAge) {
            this.yearOfBirth = new Date().getFullYear() - newAge;
        }
     })

     this.grades = [];
     this.attendance = [];
 }

 Student.prototype.isAttendanceFull = function ()  {
     const full = this.attendance.length >= 7;

     if (full) {
         console.log("Attendance is full");
     }
     return full;
 }

 Student.prototype.isValidGrade = function (grade) {
     const valid = typeof grade === "number" && grade > 0 && grade <= 100

     if (!valid) {
         console.warn("Invalid grade");
     }
     return valid;
 }

 Student.prototype.present = function (grade) {
     if (this.isAttendanceFull()) return;
     if (!this.isValidGrade(grade)) return;

     this.attendance.push(true);
     this.grades.push(grade)

     return this;
 }

 Student.prototype.absent = function (grade) {
     if (this.isAttendanceFull()) return;
     if (!this.isValidGrade(grade)) return;

     this.attendance.push(false);
     this.grades.push(grade)

     return this
 }

 Student.prototype.avgGrade = function () {
     if (this.grades.length === 0) return 0;
     return Math.round(this.grades.reduce((a, b) => a + b, 0) / this.grades.length);
 }

 Student.prototype.summary = function () {
     const avgAttendance = this.attendance.filter(Boolean).length / this.attendance.length;


‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
  this.attendance.filter(Boolean)   ===   this.attendance.filter(el => el === true)

  Ми просто передаємо функцію-конструктор Boolean в filter(), й вона автоматично перевірить кожен елемент масиву,
  чи він є істинним (тобто true):

     ◦ Якщо елемент масиву — true, він залишиться в результаті
     ◦ Якщо елемент масиву — false, null, 0, він буде відфільтрований

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

     const avgGrade = this.avgGrade();

     if (avgGrade >= 90 && avgAttendance >= 0.9) {
         console.log("Great job!")
     } else if (avgGrade >= 90 || avgAttendance >= 0.9) {
         console.log("You're good, but you could do better")
     } else {
         console.log("You need try harder!")
     }
     console.log(`Average grade: ${avgGrade}, Average attendance: ${avgAttendance}`);
     return ""
 }

 const student1 = new Student("Kate", 2001);

 student1.present(90).present(100).present(85).present(100).absent(90).present(80).present(95).present(90);
 console.log(student1.summary());

 console.log(student1.age);

 console.log(student1.grades);


‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾*/