                                                                                                                      /*
 JavaScript і парадигми програмування
----------------------------------------
 JavaScript — мультипарадигмова мова. Тобто це мова, яка підтримує кілька стилів (парадигм) програмування, і
 дозволяє вільно комбінувати їх у межах одного проєкту.

 Парадигма — це стиль або підхід до того, як ти організовуєш код

 ЯКІ САМЕ ПАРАДИГМИ МОЖНА ВИКОРИСТОВУВАТИ В JS:

 ◦ Об'єктно-орієнтоване програмування (ООП) — через об'єкти, прототипи, класи

 ◦ Функціональне програмування (ФП) — через функції, замикання

 ◦ Імперативний стиль — як у звичайному класичному JavaScript-коді (з циклами, умовами тощо)

------------------------------------------------------------------------------------------------------------------------

 Object-Oriented Programming (OOP) — Об'єкто-Орієнтоване Програмування (ООП)


 ООП в JS — це підхід до організації коду, в якому основним елементом є ОБ’ЄКТИ, що містять ДАНІ (властивості) та МЕТОДИ
 (функції, що оперують даними).


  Key Principles of OOP in JavaScript
----------------------------------------

 1. Encapsulation (Інкапсуляція):

    • Приховування деталей реалізації і забезпечення доступу до них через методи.
    • Дані об’єкта не можна змінювати напряму, їх можна змінювати тільки через спеціальні функції (методи), що надають
      доступ до даних.

 2. Inheritance (Наслідування):

    • Це механізм, що дозволяє одному об'єкту успадковувати властивості та методи іншого об'єкта.
    • В JS наслідування реалізується через прототипи або за допомогою класів.

 3. Polymorphism (Поліморфізм):

    • Це здатність об’єктів різних типів реагувати на однакові методи по-різному.
    • В JS це може бути реалізовано через методи, що мають різну поведінку залежно від типу об’єкта.

 4. Abstraction (Абстракція):

    • Відокремлення суті від деталей реалізації, тобто створення простих інтерфейсів для роботи з об’єктами без
      необхідності знати їх внутрішню структуру.


 ООП в JavaScript до ES6 (через функції-конструктори та прототипи)
-------------------------------------------------------------------

 До того, як ES6 привніс класи, ООП в JavaScript реалізовувалося через функції-конструктори та прототипи.


 ПРИКЛАД ЧЕРЕЗ ФУНКЦІЮ-КОНСТРУКТОР:


------------------------------------------------------------------------------------------------------------------------
 ПРОТОТИП

 Кожен об’єкт у JS має приховану властивість [[Prototype]] (яка в коді доступна як __proto__). Вона вказує на інший
 об’єкт, з якого цей об’єкт може успадковувати властивості та методи.

 Це називається ПРОТОТИПНЕ НАСЛІДУВАННЯ

 ПРИКЛАД:
*/



 /*
------------------------------------------------------------------------------------------------------------------------


 ООП — це парадигма в програмуванні, яка існує вже дуже давно. Деякі мови, як-от Java або C#, були створені спеціально
 для ООП і вимагають від програміста писати саме в цьому стилі.

 Однак, JS — це мультипарадигмова мова. В ній можна писати як в ООП стилі (через функції-конструктори, прототипи або
 класи з ES6), так і у функціональному стилі.

 Тож ООП в JS — це не обов’язковий підхід, а лише один зі стилів, який можна використовувати.

---------------------                                                                              ---------------------
 Один з міфів про ООП це те що для нього обов’язково потрібні класи. Але це не так. У JS не було класів до стандарту ES6
 (2015 року), однак мова вже тоді підтримувала об'єктно-орієнтоване програмування.

 JavaScript реалізує ООП через прототипи, функції-конструктори та об’єкти. Це означає, що розробники могли створювати
 об’єкти, наслідування, інкапсуляцію й навіть поліморфізм без використання класів.

 Класи в JS — це синтаксичний цукор, тобто зручніший запис для роботи з прототипами, який робить код зрозумілішим і
 ближчим до класичного ООП у таких мовах, як Java чи C++.
---------------------                                                                              ---------------------

Створюєм функцію констурктор:
 */
function Counter() {
    let count = 0;

    this.increment = function () {
        count++;
        return this;
    };

    this.decrement = function () {
        count--;
        return this
    }

    this.getCount = function () {
        console.log(count);
    }
}

const counter = new Counter(); //створили новий об'єкт прототипом якого є функція-конструктор Counter
console.log(counter);

counter.increment().decrement().increment().getCount(); //1
