                                                                                                                      /*
                                                   БАНДЛЕРИ
                                                 ‾‾‾‾‾‾‾‾‾‾‾‾

 Бандлери (bundlers) — це інструменти, які автоматично:

 1. Об’єднують (збирають) багато окремих JS-файлів і залежностей в один файл (наприклад, bundle.js)

     Залежності (dependencies) — це сторонні модулі (бібліотеки), які підключаються через npm

 2. Об’єднують SCSS-файли в один CSS-файл

 3. Мінімізують (стискають) JavaScript/CSS-код та зображення для пришвидшення завантаження

 4. Працюють у зв’язці з Babel — для трансформації коду в сумісний формат для старих браузерів


 НАЙПОПУЛЯРНІШІ БАНДЛЕРИ: Webpack, Vite

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 РАШІНЕ БАНДЛЕРИ БУЛИ НЕОБХІДНІ ТОМУ ЩО:

 1. Обробляли Node.js-синтаксис модулів (CommonJS: require, module.exports), який браузери не підтримують
       Використаня Node.js-синтаксис модулів було єдиною можливістю розділяти JS-код на окремі файли

 2. Трансформували цей код у формат, зрозумілий браузерам — тобто об’єднували всі файли й залежності в один (bundle.js)

    ↓ ↓ ↓

 Зараз, коли браузери вже мають підтримку ES-модулів (import/export), БАНДЛЕРИ НЕ ОБОВ’ЯЗКОВІ, але досі корисні для:

   ◦ зменшення розміру коду

   ◦ стиснення зображень

   ◦ об’єднання SCSS-файлів в один CSS-файл

   ◦ підключення Babel для транформації коду, тощо


‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

                                                 TASK RUNNERS
                                                ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 Task runners — це інструменти, які автоматизують повторювані рутинні задачі у процесі розробки. Вони допомагають
 розробникам не виконувати вручну одні й ті самі дії, а делегувати це спеціальним скриптам

 ЩО МОЖУТЬ РОБИТИ TASK RUNNERS:

   1. Компільовувати SCSS → CSS

   2. Мінімізувати CSS, JS та HTML

   3. Стискати зображення

   4. Автоматично перезавантажувати браузер при зміні файлів (Live Reload)

   5. Копіювати та переносити файли у папку "dist" для продакшен-версії сайту


 ПОПУЛЯРНІ TASK RUNNERS: Gulp, Grunt (застарілий)


 ВАЖЛИВО: Task Runners самі по собі не вміють виконувати ці задачі. Вони лише підключають сторонні модулі (плагіни)
          через npm, які спеціалізуються на конкретних діях:

          ◦ наприклад, плагін для компіляції SCSS у CSS

          ◦ плагін для мініфікації JavaScript

          ◦ плагін для Live Reload, тощо


 ТАКИМ ЧИНОМ: Task runner керує послідовним виконанням задач у тому порядку, який ми вказуємо, але реальну роботу
              виконують плагіни (тобто сторонні бібліотеки, які ми підключаємо через npm)


‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾*/

import './scss/styles.scss';


import { add }  from './math';
console.log(add(10, 5))

const greet = (name) => {
    console.log(`Hello, ${name}!`);
}
greet("Emma")

const numbers = [1, 2, 3, 4]
const doubled = numbers.map(n => n * 2);
console.log(doubled);

